{"work_id": "23796682", "text": "<div class=\"userstuff\"><p>Steve cracked eggs into the pan one at a time. It was a big pan, but the half dozen eggs still managed to fuse their whites together no matter how hard he tried to keep them apart. Oh well, they'd have a spatula-cut rectangle of eggs each.</p><p>He and Bucky had big appetites, their bodies always running on high, so massive breakfasts needed to be every morning. It was one of those things that sometimes fell between the cracks in the rest of Steve's life outside of Wakanda. Meals were never quite as hearty (or as healthy) as they should be to keep him going. But he kept going anyway.</p><p>It would be easy to stay, Steve thought lazily. He often entertained the fantasy, knowing it was nothing more than that. He couldn't stay, and he was already feeling the weight of this visit, as it was coming to a close. He could never stay long, and he'd already been there four days. He could sometimes stay a week, but that was even too long. It was pressure on T'Challa, on Sam and Natasha, the longer he stayed, no matter how good the reason. He couldn't do that to them for his own wants.</p><p>However, it was still nice to think about what his life could be like, waking up in bed with Bucky every morning, cooking their meals, and helping him around the farm. Even further in the future; having children, growing old together, like they always thought they would. He could slip into this domestic life so easily, if things were only a little bit different.</p><p>The back door opened and Bucky entered, with Jackal at his heels. While Jackal sniffed around the kitchen for the telltale scent of bacon, Bucky wrapped his arms around Steve's waist, pressing his front flush against Steve's back.</p><p>\"Oh, you're sweaty,\" Steve said, half laughing. He was wearing a thin t-shirt and he could feel the warm dampness of Bucky's shirt through the layers. He didn't smell bad, though, just a bit of hay and hard work.</p><p>\"It's hot out.\" Bucky kissed Steve's neck, right behind his ear, and stayed there, holding Steve, with his cheek resting against Steve's shoulder.</p><p>Steve gave the pan a gentle shake to make sure the eggs weren't sticking. He was cooking them in butter, but he still wanted to check. \"Bacon and eggs all right?\"</p><p>\"Mmhmm,\" Bucky agreed.</p><p>\"You want to put down some toast?\"</p><p>\"Sure.\" However, Bucky stayed put.</p><p>Steve turned off the burner because under-cooked eggs were better than burnt eggs. He turned around, gently holding Bucky in place so they were facing each other. \"Everything all right?\"</p><p>Bucky nodded. He tilted his face and looked Steve right in the eye. \"I'm fine. I've been thinking... I want to try the thing tonight.\" </p><p>He didn't have to explain to Steve what <i>the thing</i> was. Steve's heart started to pound, and his face grew hot as he embarrassingly got a semi at the mere thought of it. Steve swallowed hard. \"Yeah?\"</p><p>\"Yeah. I think the time's right. You're going to be going soon, and I don't want to do it when you'll be leaving the next day. If things go bad, I don't want to have a big space between us, filling up with... whatever it was that went so wrong. I want us to have time to talk it out if things get weird.\"</p><p>Steve's instinct was to deny that anything between them could get weird, but he knew Bucky's fears about all the ways this could go wrong. What Bucky was saying was smart. A bad experience followed by an extended separation wasn't what either of them would need. Bucky would need care and reassurance. Maybe Steve would, too.</p><p>\"But think about if it goes well,\" Steve said, touching his palm to Bucky's cheek. \"It could be amazing.\"</p><p>Bucky grinned. \"That's what I'm counting on.\"</p><p>Steve laughed. \"All right. What do we need? Gallon of lube?\"</p><p>\"No, I have plenty,\" Bucky replied. He turned his cheek and kissed Steve's palm. \"I have everything I need. Jackal, you, we're good to go.\"</p><p>That was all Steve needed to hear. For all of his fantasies, this one was actually going to happen because Bucky wanted it. Steve had carried such guilt over this daydream, and now they were breaking through that. \"Breakfast first?\"</p><p>\"Breakfast first.\"</p>\n<hr><p>A massive sex plan didn't mean real life stopped. Bucky still had a farm to run, and while Steve tried to help, other than a few manual labor tasks, he mostly got in the way. Bucky had a routine and Steve served as a distraction to it.</p><p>That evening, Steve fixed a light dinner, but Bucky still picked at his plate. He'd eaten maybe three bites and the rest of it was being pushed around with his fork.</p><p>\"Nervous?\" Steve asked. They sat side-by-side at the kitchen counter on stools. Bucky's two room house didn't have room for a table for eating, but Steve didn't mind. He liked sitting so close to Bucky for their meals. It was comfortable.</p><p>\"A little bit. Good nervous. I'm mostly excited. I...\" Bucky's eyes wandered over to Jackal, who was laying down after wolfing down his own dinner. \"He's a good dog. And you're a good partner and I'm lucky to have you both.\"</p><p>Steve reached over and rubbed Bucky's arm. \"I'm lucky too.\"</p><p>\"He might not go for it.\" Bucky's gaze was still locked on Jackal, and his tone slightly distant. \"This might all be a lot of anxiety for nothing.\"</p><p>\"No, no way. I think this dog wants your ass more than I do,\" Steve replied.</p><p>\"That's a damn lie.\" Bucky looked over at Steve and grinned. \"No one wants my ass more than you do.\"</p><p>Steve kissed him and smiled. \"You're damn right.\"</p><p>They left the dishes in the sink, and Bucky started pulling together supplies, mostly made up of towels. \"It's going to be messy,\" he said, when Steve eyed him. \"And one of these is to put down on the floor for my knees. I'm not as young as I used to be.\"</p><p>Once Bucky had things set up the way he wanted, he pulled Steve down onto the bed. They sat next to each other, feet dangling off the side. Bucky tangled one leg around Steve's, and rubbed his bare foot against Steve's calf, but he didn't say anything.</p><p>\"We can stop right now,\" Steve said, turning his body toward Bucky.</p><p>Really, they could stop any time they wanted to. Steve was sure he could pull Jackal off Bucky if he had to, but he didn't want it to come to that. It was all he could do to keep his hands from shaking with excitement. This was the moment that had dominated his fantasies for months -- no, years. Ever since the moment he'd seen that video, he'd hated himself for wanting it so badly. The guilt had clouded all of it, but now they were here. They were reclaiming something shameful for themselves. </p><p>Bucky shook his head. \"We can't stop, not when we're this close. I want it too much. I want... I want to do this on my terms. With you.\"</p><p>Steve leaned in close and kissed him. Bucky's metal hand slid around the back of Steve's neck, cold and grounding against his hot skin. Steve slipped his hand under the front of Bucky's shirt, and as he did, Bucky moved back just enough to pull off his shirt completely.</p><p>\"You're getting naked,\" Steve said slowly. \"Should I... get naked too?\"</p><p>\"Yes,\" Bucky replied right away, and then hesitated. \"Maybe leave your underwear on? I might get distracted. But -- touch yourself, do whatever you want. Take off whatever you want.\"</p><p>Steve rested his hand and Bucky's cheek and kissed his temple on the other side of his face. \"I love you.\"</p><p>Bucky's shoulders relaxed. In fact, all of him seemed to lose tension. \"I love you too. You want to prep me?\"</p><p>\"Yeah,\" Steve said hoarsely.</p><p>Flashing Steve a grin, Bucky stood up and kicked off his jeans and underwear. He was already sporting a semi, and Steve's mouth went dry. He never got over the absolute <i>privilege</i> of seeing Bucky's body. </p><p>Bucky climbed back onto the bed, presenting his ass toward Steve. \"I don't need a lot. If he -- it won't take Jackal long to provide his own.\"</p><p>Steve, who had been getting the lube from the bedside table, paused. He'd seen the video of Bucky getting fucked by the German Shepherd. He'd watched it many times, even, but he never looked into anything else like it. It had always been less about the dog itself, and all about Bucky. But there was something about what Bucky had just said that made him realize he didn't really know what went into this.</p><p>He scooted closer to Bucky and gently touched his backside to let him know he was that close. He got a small amount of lube on his fingers and pressed them slowly inside Bucky.</p><p>Bucky moaned appreciatively, leaning forward and resting his head on the mattress.</p><p>Steve worked the lube gently. There was time for being rough later. Everything after this moment was unpredictable, but the least this was going to be soft. He pressed a kiss to Bucky's hip. \"Feel ready?\"</p><p>\"Let's do it,\" Bucky said, and he groaned when Steve pulled out his fingers. The noise caught Jackal's attention, and he sauntered over to investigate. Bucky grinned and scratched Jackal behind the ears. \"Hey buddy, you wanna... well, play makes that sound weird.\"</p><p>Jackal licked Bucky's hand. </p><p>Bucky slipped off the bed and walked over to the middle of the floor where he had set up the towels. Some were in a stack, while others had been folded up and placed on the floor so Bucky could rest his knees, and maybe even his elbows, on them. Instead of going to a kneeling position immediately, Bucky sat down on the floor. Jackal got right up in his space, so close he could easily rest his chin atop Bucky's head. </p><p>Steve's heart was pounding so hard it thundered in his ears. Fuck, this was <i>happening</i>. He stood up and scrambled out of his clothes, not wanting to tear his gaze away from what was happening in front him for even the amount of time his shirt would go over his eyes. He followed Bucky's advice and left on his underwear. Maybe it would help keep both of them from being distracted.</p><p>Jackal was practically in Bucky's lap, his nose pushing up against Bucky's neck, making him laugh. Eyes bright, Bucky looked over Jackal's shoulder at Steve. \"You coming?\"</p><p>\"Yeah -- Yeah.\" Steve got down on the floor, with Jackal between them. \"What do you want to do?\"</p><p>\"Assume the position, I guess,\" Bucky said with a wicked grin. He gave Jackal a quick peck on his muzzle, and was rewarded with a sloppy doggy kiss across the cheek. He sat up onto his knees and lined them up carefully on the towel, then leaned forward to kiss Steve one more time. \"You don't have to stay right here in front of me. I want you to get a good look. It's for you just as much as it's for me.\"</p><p>A lump formed in Steve's throat. After everything they'd been through, after every conversation and experience that had led them specifically to this moment, Bucky trusted him. Bucky still had the capacity to trust another person, even when he would have every right not to. </p><p>This wasn't the time to get emotional, at least not yet, so Steve pushed it down. \"I'll be right here the whole time. Within arm's reach. You'll tell me if you need me.\" It wasn't a question. Steve could sometimes still give orders.</p><p>Bucky nodded. \"I'll tell you.\"</p><p>\"Do -- do we need a safeword?\" Steve asked. The eleventh hour really wasn't the time to bring that up, but better late than never, right?</p><p>\"If I want to stop, I'll let you know. No games or anything. Just an old fashioned 'I need to stop.'\"</p><p>Steve nodded. He kissed Bucky tenderly. \"Then assume the position,\" he mumbled, lips still brushing against Bucky's mouth. </p><p>Bucky laughed nervously, but he had a smile on his face, his eyes shining with anticipation. He dropped first onto his hands, and then went down further onto his elbows, his hair hanging over his face. His legs spread some, but Steve was familiar enough with Bucky's body, especially like this, to know exactly how open he was.</p><p>Steve kept an eye on Jackal, who was at least curious by this new game, snuffling first at Bucky's face, as if checking in to make sure he was all right. When Bucky laughed, Jackal seemed pleased by this enough to explore further.</p><p>Then, they waited. Steve stroked Bucky's hair gently. It was almost like he was petting a dog, he thought with a chuckle, and watched Jackal press his nose against the outside of Bucky's thigh. Bucky's breath hitched.</p><p>\"You good?\" Steve asked quietly, as not to startle the dog right when he was moving in the right direction. </p><p>Bucky nodded. He shifted his arm forward and gave Steve's calf a squeeze. He gave another sharp gasp, but relaxed as quickly as he had tensed.</p><p>Jackal had shoved his nose right into Bucky's ass. Steve's chest tightened. He'd been so sure that Jackal was going to do it, but this -- it was going to happen. He knew, like a flash, that it was going to work. It was real, and it was happening in front of him.</p><p>Bucky let out a quiet laugh as Jackal's head dipped low where Steve couldn't see what he was doing. \"He's licking my balls,\" Bucky said, as if reading Steve's mind.</p><p>Steve gripped Bucky's hair a little tighter. It didn't matter that he couldn't see. His imagination was running wild. He'd seen what Jackal's tongue could do, slurping come out of Bucky's asshole, even licking at Steve's own cock a few times. Steve's underwear was unbearably tight, his dick throbbing to be touched.</p><p>Jackal lifted his head and he started pacing behind Bucky in tight circles, his toenails tapping against the floor with each step. Steve's eyes widened when he spotted the thick, red cock between Jackal's hind legs, out from its sheath, shiny and <i>ready</i>. He went back to sniffling Bucky's ass, his face again disappearing out of Steve's view.</p><p>\"Is he--\" Bucky started, but he didn't get to finish, as Jackal suddenly mounted him. He squeezed Steve's calf again, his breaths coming out in short, ragged huffs. \"Oh. <i>Oh</i>.\"</p><p>Steve wasn't sure where to look. He wanted to keep an eye on Bucky, but his gaze kept being drawn to Jackal, towering over Bucky with his front legs wrapped around Bucky's stomach, and his hips thrusting wildly.</p><p>\"He's trying to find -- he's in. Oh fuck, he's in. He's in.\" Bucky dipped his head so low his forehead touched the floor. \"Oh, Jesus Christ.\"</p><p>\"You okay?\" Steve asked. He couldn't stop staring. He wasn't sure how he imagined himself to be some passive observer to this, because the reality was that every part of him felt like it was on fire. </p><p>\"Yeah,\" Bucky replied, his voice cracking. \"I can feel it swelling. He's so big. He's getting bigger and... oh fuck. It feels -- it's so good.\" He gave Steve another squeeze. \"Go watch. I'm all right -- I'm good.\"</p><p>Steve took a beat, almost protesting that he was fine where he was, but that wasn't true, nor was it what Bucky wanted. He kissed the top of Bucky's head and slid over to the side where he could get a full view, but as promised, he stayed close. He kept one hand on Bucky's shoulder, and the other went into his underwear to pull out his cock. He was painfully hard and when he wrapped his hand around the shaft, he could feel his pulse hammering through his palm.</p><p>From his new angle, he could see everything. It was nothing like the worn out, grainy footage Steve had jacked off to years ago. Everything was heightened, inches away from his face, overwhelming him with details.. Bucky's hard cock bobbed with every thrust of Jackal's hips, precome splattering against the floor. His skin was flushed pink from his neck to his ass, his body already shiny with sweat. Jackal's tongue lolled out the side of his mouth with a big doggy grin as he fucked Bucky.</p><p>Steve's eyes widened, his cock twitching in his hand, when he caught a glimpse of Jackal's dick. It was more than double the size it had been when Steve had seen it moments before, and the knob at the base was beginning to swell.</p><p>\"Fuck,\" Steve breathed, digging his fingers into Bucky's shoulder. \"I'm -- this is -- <i>fuck</i>.\"</p><p>Between his loud, ragged breaths, Bucky quietly asked, \"Steve?\"</p><p>Complete thoughts had dried up, and Steve was now a mess of barely formed words. The slope of Bucky's back, the smells of sweat and dog surrounding them, and the wet sound of Jackal's dick plunging deep in Bucky's wet hole, it all came together in a perfect moment. It took Steve's breath away.  </p><p>Realizing perhaps a moment too late that Bucky was checking in on him, Steve replied, \"It's s'hot. God, Buck, you're gorgeous.\"</p><p>Bucky moaned in response, burying his face against his forearm. </p><p>Steve was barely aware he was jerking himself, his attention caught on the way Bucky kept spreading his legs open further, inviting more, silently begging Jackal to go in deeper. Steve was snapped back into his own body when he came, spilling hot all over his hand, his mind lost in a blissful moment of white-out pleasure.</p><p>\"Oh,\" Steve mumbled. He was a mess, his hand and the floor around him sticky. Still half dazed, he didn't put a lot of thought into his next move: wiping his hand on Bucky's back, right in front of Jackal's nose.</p><p>Jackal eagerly licked it up, never slowing his enthusiastic humping. His tongue worked in long strokes across Bucky's sweat-shiny back. </p><p>Bucky gasped. He pushed his ass back toward Jackal as his orgasm rippled through his body. With a mangled wail, he slapped his palm against the floor. Bucky inhaled deep with a rasp and exhaled with a sob.</p><p>Steve turned and wrapped his arm around Bucky's chest and pulled himself close so he could kiss Bucky's shoulder. \"Hey, hey, you okay?\"</p><p>\"Uh huh,\" Bucky mumbled. He rubbed his face against Steve's bicep. \"I'm fine, I'm good. It's overwhelming. I'm -- ahhha!\"</p><p>Steve jerked his head up just in time to see Jackal swing his leg over Bucky's hips so their asses pressed together with only Jackal's knot holding them together.</p><p><i>\"Steve,\"</i> Bucky hissed, and Steve's attention snapped away from Jackal and toward Bucky's face. He slid back in front of Bucky where he had started, carefully cradling Bucky's face between his hands.</p><p>\"I'm here,\" Steve said. He leaned down, burying his nose in Bucky's hair. It reminded Steve of mornings, when he would roll over onto Bucky's side of the bed after Bucky went out to work, and Steve would breathe in that scent of clean hair and sweat on his pillow. \"I'm right here.\"</p><p>\"His knot is so big,\" Bucky whispered. He wrapped his vibranium hand around Steve's forearm and squeezed. \"It keeps pulling and it feels -- so much.\"</p><p>\"Good so much?\" Steve asked. He didn't move, except to look up at Jackal, who was pushing back against Bucky with a low whine.</p><p>Bucky groaned and rolled his hips. \"Yes, no... yes. He's still coming. He's pulsating. He's -- fuck me.\"</p><p>Steve kissed Bucky's head and chuckled. \"I can't, because Jackal has already made you his bitch.\"</p><p>\"Fuck you, Steve, you can't say shit like that to me right now,\" Bucky replied, with a hint of a breathless laugh. He turned his face so his cheek was right in the center of Steve's palm. \"Mmm, thank you for this. Thank you for understanding.\"</p><p>Steve smiled. \"Because I didn't get anything out of it. Maybe we just understand each other.\"</p><p>\"Good job to us,\" Bucky mumbled. He shifted so he could wrap his other arm around Steve's waist, with his head in Steve's lap. Steve moved his hands so he could gently massage the back of Bucky's neck while they waited. </p><p>As the time passed, Jackal seemed to get restless, tugging harder to free himself from Bucky's asshole, leaving both of them whimpering. Finally, Jackal popped free, and Bucky's knees went right out from under him, collapsing into Steve's arms. </p><p>\"Fuck,\" Steve murmured. Even after nearly ten minutes of the swelling going down, he got a look at almost the full size of Jackal's penis, and it was monstrous; thick and impossibly long. Steve's own cock twitched at the mere thought of that thing having been inside Bucky.</p><p>\"Does he seem okay?\" Bucky asked. There was a slight slur to his words, tired, but coherent.</p><p>Steve hadn't quite taken his eyes off of Jackal. The dog was curled up in his bed, licking his cock in those long strokes that drove Bucky wild. Semen still spurted occasionally and Jackal contentedly lapped up his own as he did Bucky and Steve's.</p><p>\"He seems fine,\" Steve replied. \"Normal.\"</p><p>\"And, uh, was it what you wanted it to be?\" Bucky asked quietly. His arm was still around Steve's waist, but now that he was on his side, he curled up, his knees pulled almost to his stomach.</p><p>Steve could see the come pooling out of Bucky's asshole. Steve remembered once, a few months earlier, having been so pleased with himself for putting so much come into Bucky that it had trickled out when he walked, but that was nothing compared to the mess on the floor now. Though maybe, in a way, Steve had put it there, too.</p><p>\"It was amazing,\" Steve replied, brushing the hair away from Bucky's face. He smiled down at Bucky, who cracked a cheeky grin right back at him. \"I felt like someone turned the contrast up on high. It was the best sort of dream come true. Was it what you wanted it to be?\"</p><p>Bucky hesitated and Steve's stomach flip-flopped. He wanted it to have been as good for Bucky as it had been for himself, but Bucky was the one who had submitted himself. In the big picture, it didn't matter what Steve thought. If Bucky had hated it, would he resent Steve for having enjoyed it so much? Would they lose something in this? Steve's heart weighed heavy at the thought.</p><p>\"I think I wanted to want it,\" Bucky said, licking his lower lip. He took a shaky breath and shivered. \"I wanted to have this control over it, like... if I could control this, make it mine, then it could erase everything else. But this, you, me, and Jackal, it's different. It's a whole, a whole different thing. It's nothing like -- it's better, it's everything. It wasn't what I wanted, but I don't think what I wanted could be real. This is, it's so much more than that. It's mine, and you're mine, and that's all I want. It's all I need.\"</p><p>\"Me too.\" Steve felt a fat tear roll down his cheek. Bucky had endured so much, and now he wanted so little. It pained Steve to think about leaving, to deprive Bucky of one of the few things he felt he needed. There were no easy answers, no simple conclusions. He had to focus on what they had right now, and this was it. The two of them together, the way it was meant to be. Holding Bucky close while he settled.</p><p>Steve sniffed loudly and scratched the back of Bucky's neck. \"You want to take a hot shower? I'll hold you up.\"</p><p>\"Yeah, but...\" Bucky sounded a little sniffly himself. He closed his eyes, but he was smiling. \"I think I want to lay here for a few more minutes if that's all right with you.\"</p><p>Steve relaxed, running his thumb over Bucky's skin, tacky as the sweat began to dry. \"We'll stay right here, as long as you want.\"</p></div>"}
{"work_id": "23812675", "text": "<div class=\"userstuff\"><p>A brothel’s a strange place to grow up, stranger still once a young boy starts to feel his biology come to life. The madam was very protective of him, insistent he never be seen by clients. The very first thing she taught him was the first thing she taught all her girls:&nbsp;<em>no one touches you without your say so. If they do, you tell me</em>.&nbsp;</p>\n<p>So the boy made it through many perilous years with nothing but little boy crushes on the girls that were met with giggles and smiles and&nbsp;“Oooh he’s going to be trouble!”</p>\n<p>And he was.</p>\n<p>A few years of fetching water for hot baths for clients and hygiene built a sturdy back and broadening shoulders, thighs thick and ropy to heft the heavy buckets high. The girls spoiled him, not with trinkets or sweets, but with meat, which he ate ravenously. The twists and turns of mopping and scraping and cleaning a filthy house grew sinewy muscles across his torso. But the madam, who had first thought this boy could be a bulky deterrent to more aggressive patrons, knew it was not to be. Not with rosy cheeks like those, or that mouth that seemed to redden with every year.</p>\n<p>Already an expert at all the hiding spots in the house, he took to listening to the girls-- at first to stifle his laughter at their ridiculous cries and moans, but within a few years he found himself listening for an entirely different reason. And not just to them, but to their clients: their deep voices husky with lust, at the thick grunts they released as they thrust away, at the few who seemed to give over entirely to their passions and growl with pleasure.</p>\n<p>As he reached eighteen, the boy grew more flirtatious, learning the seductions the girls leveled at their clients and trying it back on them. Once the madam caught a few of them red-handed,&nbsp;“teaching” the boy how, precisely, to please a woman (very easy to find them out from the sounds this girl was making), she told him it was time for him to go.</p>\n<p>He begged her to let him stay, to let him diversify her offerings for her patrons. She quirked an eyebrow, but he told her he very much understood what he was suggesting. He knew they didn’t entertain female patrons-- not by rule, but by opportunity. And he knew what he wanted.</p>\n<p>So she told him again:&nbsp;<em>no one touches you without your say so. They do, you tell me.</em></p>\n<p>He’d line up for new clients with the girls, starched and pressed, his linen shirt teasingly unbuttoned, his hair slicked and polished, his cheeks rosy and his lips wet. Of course some of the men were unappealing; their gaze, their gait, their dress. And still they’d pass him over. He grew haughty, if only to cover his hurt.</p>\n<p>Until one day, when a man walked into the house that sent a jolt up his spine. The boy heard the frightened murmurs of the girls as they pinched their cheeks and made sure their lingerie was undone in just the right way and scurried to the parlor. Belle (a decade older now and still commanding) pinched his cheeks to their rosiest and gave him a sharp kiss, both puffing his lips and transferring some of her rouge onto them, before giving him a wink and slipping through the curtain to the parlor.</p>\n<p>The patron was already glancing at the girls softly, a bit hunched for his height, as though trying to seem smaller. The truth is he was broad, lean, and quite imposing in his light armor, his hair wild, the makings of a beard appearing, actually quite filthy from time on the road. He still carried two swords strapped across his back.</p>\n<p>When the boy fell in line and met the man’s eyes, he found a shock of yellow. A silver medallion aground his neck. He straightened to his full height in front of the boy-- who could do nothing but drink in this mountain of a man: even his hands in his gloves were thick. The boy couldn’t help but glance hungrily at his trousers, searching for a hint, a hope, of what was within. If it was....&nbsp;<em>proportional</em>... the boy swallowed hard, even more flushed with desire. At least when he was passed over again, he could think about this wild man as he jerked off. He’d probably think about him for years.</p>\n<p>The boy looked back in his eyes to find him&nbsp;<em>smirking</em>. His mouth fell open as the man simply asked:&nbsp;“Will you, pretty boy?”</p>\n<p>In an instant, the madam was beside them both, looking at the boy fearfully. The boy somehow found himself smirking back, licking his lips, knowing he looked like a little shit, and said:&nbsp;“Anything you like, sweetheart.”</p>\n<p>The madam swept the man aside; the boy heard a hushed conversation take place. A barter over price. Belle saw his irritated expression and quietly reminded him:&nbsp;“He’s your first, darling, you know what that means. I imagine she’ll ask for quite a sum.”</p>\n<p>“I’ll pay it.”</p>\n<p>The boy’s eyes widened and found heat already pooling within him. Things seemed to happen in a blur after that. The price agreed, the man was whisked through a door to the bath, and the boy followed, vaguely grateful he no longer needed to fill the tub. He glanced back at the madam as she closed the door behind them, giving her an encouraging wink. He turned back and found the man setting down his swords, beginning to undress.</p>\n<p>“What shall I call you, sir?”</p>\n<p>The man smiled softly.</p>\n<p>“Sir will do.”</p>\n<p>“Shall I help you undress, sir? Or would you perhaps like to watch me?”</p>\n<p>“What you&nbsp;<em>shall</em>&nbsp;do is stop asking so many questions, pretty boy. Listen, and obey. Do you understand?”</p>\n<p>“Yes, sir.”</p>\n<p>“Good. Now sit there and watch me. Can you do that?”</p>\n<p>“You wish me to watch you bathe?”</p>\n<p>“Or perhaps you’re more of an idiot than even your mouth suggests.”</p>\n<p>“My mouth&nbsp;<em>can</em>&nbsp;suggest quite a bit. Sir.”</p>\n<p>The man leveled him with a look that had the boy’s heart racing.</p>\n<p>“We’ll see about that.”</p>\n<p>The boy swallowed hard and kept the man’s gaze as he slowly unfastened his clothing, gently dropping it to the floor, slowly revealing more of his broad body. Scars twisting up his thick fingers and arms, white and sliced across his chest, disappearing into the dark hair there.</p>\n<p>“Yes, sir,” the boy said, and he sat, earning a short smile. The man bent to unfasten his boots, watching the boy as he worked. The boy felt so flushed, so focused upon, he started working open his doublet.</p>\n<p>“Did I tell you to undress?”</p>\n<p>“N-no, sir.”</p>\n<p>“Then stop.” The man straightened, his feet free, and got to work on his trousers, stepping towards the daybed where the boy sat.&nbsp;“You know, I had thought, since this is your very first time, to ask you how you’d like things to proceed. I can tell I’m going to have to be very firm with you, aren’t I?”</p>\n<p>He was within arm’s length now-- the boy could feel the heat on him, could smell the muck and musk of him, could see the dark hair at his waistline, dipping lower as he eased his trousers down. He definitely wanted him to be firm with him. He fluttered his eyelashes and looked up at him with a smirk.</p>\n<p>“<em>Yes,</em>&nbsp;sir.”</p>\n<p>The man casually walked away and bent to remove his trousers, straightening to eye the boy, his cock revealed-- pride but also apprehension in his eye. The boy’s mouth dropped open. He may have been drooling slightly-- impossible to say. All he could say, at the sight of the&nbsp;<em>definitely proportional, very thick</em>&nbsp;cock was:</p>\n<p>“Please, sir.”</p>\n<p>“What was that?”</p>\n<p>He licked his lips.&nbsp;“Please. Sir. Can I--? Let me--.”</p>\n<p>The man smirked and sank into the water, groaning deliciously at the warmth. The boy was going to be made to wait, it was clear. So he waited as patiently as he could, affecting boredom, releasing tortured sighs as he watched the man slowly,&nbsp;<em>so frustratingly slowly</em>&nbsp;scrub his skin, his hair, his yellow eyes fixed on him.</p>\n<p>He finally stood and stepped from the tub-- the boy leapt to his feet to offer a sheet of linen.</p>\n<p>“Easy, pretty boy,” he said, wrapping the sheet around his hips, stepping away from the boy’s eager hands.&nbsp;“Lead me to my room.”</p>\n<p>“Yes, sir,” the boy replied, his frustration mounting, and led the man through a doorway, up the stairs, to a small room with little else inside but a simple bed.</p>\n<p>The boy closed the door and rounded on the man, who chuckled softly. The boy’s hands flew to his doublet again.</p>\n<p>“None of that, none of that, pretty boy.”</p>\n<p>“<em>Sir</em>, will you-- can we-- will you get on with it?”</p>\n<p>The boy found himself slowly backed into the door, the imposing man pressing him there, his yellow eyes glancing at his hand, which he drew up the boy’s thigh, across his hip, eliciting a shiver of pleasure. They locked eyes as the man’s huge hand teased towards the boy’s cock, already half-hard. He smiled.</p>\n<p>“You have quite a mouth on you, little&nbsp;<em>brat.</em>&nbsp;Shall we see what else it can do?”</p>\n<p>The boy flushed straight from his cheeks down his throat, his cock still firming against that thick hand. He tried to remain surly, but it really came out as a plea:</p>\n<p>“<em>Yes, sir.”</em></p>\n<p>He followed the man to the bed, watched as he swiftly removed the linen cloth and sat, and quickly sank to his knees and took a minute to marvel at the cock before him before getting to work eagerly. He’d always hoped he’d be impressive at this right off the bat, but as he slurped and struggled with the considerable length, he heard the man chuckle, and his face flushed red again with anger. The man grasped his hair and pulled him back.</p>\n<p>“<em>So eager,</em>&nbsp;pretty boy. That’s enough, now-- I know you’re dying to, so take off your clothes.”</p>\n<p>“Yes, sir,” he said, wiping his mouth as he stood, sullen now, and watched the man lay back on the bed to take in the view. The boy slowly unbuttoned his doublet and made a show of teasing off his linen shirt. He smirked as the man took his own dick in hand and stroked himself as he watched him bend over to remove his shoes.</p>\n<p>“Keep going, pretty boy.”</p>\n<p>“Yes, sir,” he said again, as sultry as he dared. He came close to the man as he unbuttoned his trousers, standing between his legs as he slowly pulled them down over his hips and off his cock. The man made an appreciative hum that made it twitch slightly, embarrassingly.</p>\n<p>“Bend over and take these off, now. And don’t move til I tell you.”</p>\n<p>“Yes, sir,” he breathed, turning to bend and give the man a full view of his round ass. He heard an even more satisfied grunt, and smirked again, his pulse racing. He stayed there, bent over, obediently waiting for the next instruction, completely exposed. He heard the man shifting on the bed behind him. A clink, a stopper. A moment later, he felt his large hand grip his hip-- warm and surprisingly soft. And a soft voice:</p>\n<p>“Are you sure you want to do this, pretty boy? I’ll take my time. I’d love to take my time with you.”</p>\n<p>He could feel the man’s breath on his ass and shuddered.</p>\n<p>“<em>Yes</em>--” he breathed.</p>\n<p>“Yes...?”</p>\n<p>“<em>Sir.”</em></p>\n<p><em>“</em>I think I’ll have to make you beg for that.”</p>\n<p>His hand on the boy’s hip gently shifted him onto the bed, on his elbows and knees, as he slowly fingered the boy open, leaving him panting and pleading.</p>\n<p>“<em>Please, please, sir, I’m ready, I need--”</em></p>\n<p><em>“</em>I’ll tell you what you need.”</p>\n<p>He smacked his ass softly, a warning. The boy moaned.</p>\n<p>“<em>Please, please fuck me, sir--”</em>&nbsp;he gasped, and felt the man withdraw completely.&nbsp;“Sir...?”</p>\n<p>“Come to the window,” he said, already opening the view out to the street.&nbsp;“I think we could do a little advertising, don’t you?”</p>\n<p>If it was possible for him to flush even more, he did as he made his way to the window and bent over again, his face just at the opening. He relaxed as much as possible and felt those broad hands grasp his hips again, looking and spreading him apart.&nbsp;</p>\n<p>He saw the baker walk down the street, humming to himself.</p>\n<p>He groaned deeply as the man slowly pressed into him, his tip just easing past his tight entrance. The baker looked absently for the source of the noise.</p>\n<p>“So good, you’re doing so good for me, pretty boy.”</p>\n<p>He tensed slightly at the awkward sensation, the burning, and breathed deeply.</p>\n<p>“That’s it, are you still sure?”</p>\n<p>“Yes, yes--&nbsp;<em>please, sir</em>.”</p>\n<p>“Good,” the man said, slowly pressing into him more, stilling to let the boy get used to the feeling.&nbsp;“Because I’m going to fuck you so deep you won’t be able to work for days. Is that what you want, my pretty, pretty boy?”</p>\n<p>“<em>Fuck-- yes, sir,</em>” he said, arching his back against him to create some friction, earning another slap on his ass.</p>\n<p>“Now, now, I’ll decide. I’m the patron, remember? Needy, filthy thing.”</p>\n<p>The boy could only moan as the man slowly shifted and dragged inside him. The man reached to thumb over the head of his cock and he could feel his orgasm building already.&nbsp;</p>\n<p>He saw a woman leading her cows out to the south pasture just before his vision blurred, her head ticked up to place the moan she heard.</p>\n<p>“So good, so good for me,” the man said, his hips snapping against the boy, fucking into him roughly now.</p>\n<p>“<em>Please, please, sir-- I’m going to--</em>”</p>\n<p>“Then fucking come, you brat.”</p>\n<p>A thick hand grabbed his hair and pulled his head back as he moaned deliciously into the street, coming in streaks across the windowsill, exposed for all the world, his flushed cheeks and red lips an advertisement of amusements within. He fell forward, clutching the sill and catching his breath as his patron kept thrusting into him, still moaning hard and shuddering from the overstimulation.</p>\n<p>“I’m going to cum inside you, would you like that?”</p>\n<p>“<em>Oh, fuck, yes sir</em>.”</p>\n<p>“Enough to beg for it?”</p>\n<p>“<em>Please-- please-- defile me.”</em>&nbsp;He turned and looked back at his patron, flashing him a cheeky, dimpled smirk, and felt him grip his hips even harder and thrust deeply as he came. He waited as the man stilled and slowly pulled out, wincing at the friction and feeling. He was dismayed to see he looked perfectly composed; his breathing was still and normal.</p>\n<p>“Why so upset, pretty boy?”</p>\n<p>“It’s just-- I thought you’d be more, er-- disheveled, sir. Are you satisfied?”</p>\n<p>“No,” the man said with a devilish grin.&nbsp;“But we have all night.”</p>\n<p>What else could he do? The boy blushed.</p></div>"}
{"work_id": "23800645", "text": "<div class=\"userstuff\"><p>The door to the locker room was nearly hurled from its hinges with a thunderous crash as a big, black boot forced it open. The rage on the face of Rhea Ripley spilled out into her actions. You were trying not to catch her attention as you hastily jammed all of Alexa Bliss’ belongings into her suitcase as she instructed. <br>Alexa was outside, still in her ring gear, getting the car ready to go. After rolling up Ripley in their match tonight, earning an unexpected victory, Alexa was being hunted down by the furious Australian. You zipped up the large luggage case and began making your way towards the door.<br>“YOU!” Rhea called out from behind. You froze in place as you heard her boots stomp on the concrete floor towards you. She grabbed one of your shoulders and turned you around, pinning you against the doorframe. <br>“When you bring that bitch her luggage...” she hissed, face to face with you. “Tell her. I’m coming for her ass, and if I don’t get it. Well. I might just take yours instead!”<br>You were stunned, shaking in place as she let go of you and began to pick up her own bags and leave. You got the hell out of there, unsure of what she meant by her threat at you. You made it out to the parking lot, heart racing and jumped into the back seat of the rental car, Alexa and Nikki waited for you in the front and peeled out as soon as you closed your door.</p><p>A week later, a new show in a new arena, you’d almost forgotten about your little confrontation with the menacing Ripley. This arena was a fair bit bigger than last week’s. Private locker rooms came as a relief to you. As you did your usual duties of helping Alexa and Nikki set up and get into their gear, you thought it good that you didn’t have to come face to face with Rhea again. Until Alexa said to you<br>“I’ve got a little task I need from you.”<br>“Yes?” You were conditioned to ask<br>“Our match is about to start, so I need you to take this to Rhea for me.” Alexa handed you a small note, folded up and stuck closed with a little piece of tape. What was this? Middle school?<br>You took the little note from Bliss and left the room, nervous about approaching the explosive Australian. You found her locker room at the opposite end of the hallway and gathered yourself outside the door. A sound from inside caught your attention. You could hear Rhea inside, grunting and muttering to herself. Uh oh. She seemed angry. Before you could even decide to abandon this plan, slip the note under the door and run...the door swung open. Rhea stood there, already dressed in her street clothes. A heavy metal t-shirt, baggy sweatpants and red running shoes. She pulled the headphones out of her ears to say<br>“What the hell do you want, pipsqueak?” Her blue-green eyes drilling right into you. <br>You shakily raised the note up for her to see. Rhea shook her head and reached a strong hand out to you, grasping the collar of your shirt and dragging you into her locker room before you could say a word.</p><p>As the door of Rhea Ripley’s private locker room closed behind you, all you could think to do was put your hands up, expecting to be attacked. Rhea stood in front of you, arms crossed like she was waiting for something. <br>She broke the silence; “So what are you, her mailman? She’s got you carrying her bags, bringing her meals, and licking her boots too I’d imagine.”<br>You remained quiet, not letting Rhea know just how close she got to the truth. “You gonna read the damn thing or what?” She spat while gesturing to the note in your trembling hand.<br>You broke the seal and began to read<br>“D-dear...Rhea...” you froze up as your eyes scanned the rest of the note. There was absolutely no way you could read this to her. It was insulting, literally.<br>“God. Gimme the fuckin’ thing.” Rhea snapped. She snatched the paper out of your grasp, her painted black nails scratching you slightly as she pulled back. The strong-featured blonde cleared her throat and began to read.<br>“Dear, Rhea. It has come to my attention that you were not so fond of taking a loss to myself one week ago.” She paused, sweeping her hair off her face and shooting you a piercing look before continuing. <br>“I was unaware that you were such a sore loser.” Rhea’s voice became louder and angrier with each word.<br> “Maybe my assistant here would like to explain in further detail how you lost for you to better understand the situation, in hopes your temper will cool and you stop bitching.”<br>The last word was barely recognizable as Rhea shredded the small note in her hands and grit her sharp looking teeth while speaking. She lunged towards you and you stumbled backwards into the door. You fumbled for the handle but Rhea wrapped her enormous, muscular arms around you and threw you away from the door. You looked up from the floor to see her locking the door with a maniacal look on her face. </p><p>As Rhea slowly stepped over to you, you began to shake with fear. You knew whatever was about to happen was going to hurt, and you might not walk out of this arena under your own power tonight. You thought you saw something move in her pocket as she walked, and tried not to think of what it could be or how she might stab you with it. Ripley towered over you and took in a few deep breaths, her eyes locked to yours and shining with fury. She leaned her face down towards you and spoke rather quietly.<br>“If Alexa thinks I’m going to take this shit and like it, she’s got no idea what I’m capable of. Now. You on the other hand. You’re just the errand boy, the slave.” She stopped to think for a moment. “You know, if I were Alexa, I’d feel compelled to loan your services out as payment for insulting me.” Sarcasm and spite dripped from every word her devilish tongue produced. “I told you I’d get your ass, and now...it’s mine!” She picked you up by your shirt, forcing you to sit up, and pushed you against the nearest wall. Your brain rattled from the impact. Rhea stood up tall with your head at knee level to her, then she reached with both hands for the waistband of her sweatpants. Hooking her thumbs into her pants, Rhea swiftly tugged them off her hips-<br>‘What the fuck?’ You thought.<br>Rhea’s underwear had gone with her pants right down to the floor, and before you was the last thing you could’ve expected. Between Rhea’s legs hung a very long, thick penis with heavy, dangling testicles to boot. How was this even possible? It swung gently as Rhea leaned towards you, grabbing your hair and pulling your face up closer to her impossible loins.<br>“What’s the matter? Never seen one of these before?” Ripley cackled. “Be a good boy and get me hard.”<br>Jesus. She wasn’t even hard yet, and still this cock hung more than half-way down her inner thigh. The wild blonde grabbed her heavy shaft in one hand and pointed her weapon towards your face. She began slapping it against your cheeks and lips. You could feel with each smack it became more and more engorged and solid.<br>“Open your mouth before I rip it open!” Rhea roared suddenly. You slowly eased your lips apart, staring directly at the tip of Rhea’s penis. She then put one hand on the back of your head and forced her cock as far into your mouth as she could manage, her semi-hard meat slipped between your lips and into the back of your throat before you could even breathe. You gagged horribly as a musky scent filled your nose. Rhea began to viciously hump your face as her dick began to expand inside of your mouth until she was fully erect. Your jaw ached with fiery pain as the enormous penis in your mouth was forced in over and over again. You gagged each time she slammed the plump tip into the back of your throat, your teeth couldn’t be stopped from digging into her flesh each time. But that only seemed to get her more riled up. Tears built up in your eyes as you struggled to breathe, but you managed to glimpse that half of Rhea’s monster cock was still hanging out of your lips, unable to get any deeper into your agonized throat. You really thought this was where you would die. You closed your eyes and tried to think of something else, but the feeling of your attacker’s throbbing shaft in your mouth just kept hitting you. The sensation of her hot, musky skin sliding across your tongue, veins bulging on your lips, the wet churning sound it made when her rod pushed deep into your throat. You were teetering on the edge of consciousness and then you heard Rhea start to moan and grunt. <br>‘That’s it.’ You thought ‘If I can just make her cum it will all be over.’<br>You tried to take in some air through your nose as best you could before leaning into each thrust, managing to squeeze an extra inch of Ripley’s penis down your sore throat. You extended your tongue past your lips and began licking the underside of her shaft. She put both hands on your head and began pumping in short bursts muttering under her breath<br>“Cum...cum....cuuuuu....”<br>You nearly vomited as the first gush of Rhea’s orgasm blasted your throat, she unsheathed her cock from your mouth which pulled a sound out of your lungs by force.<br>“Hhhhuuuuuuaaagggghhh...!” was all you could say before she yanked your hair and pointed her cannon right at your face, another blast of hot white juice was fired onto your waiting face. Rhea groaned<br>“Ohh fuuuck...open your...mouth!”<br>You did as you were told and opened wide, tongue hanging out like a dog. You accepted every rope of Rhea’s thick, warm load across your face and open lips. You’d never felt so ashamed, hurt and vulnerable. Thank god nobody could see this. The taste was a mixture of salt and sweat, it was disgusting though your tongue adjusted to it. The pungent smell of her musky cum and sweaty balls flooded your senses.<br>Rhea shuddered as the last drops of her semen fell onto your lips. She then grabbed you under the arms and lifted you onto your feet. You barely had time to gain your bearings before she dragged you over to a table in the corner of the locker room, then slammed your head down with a bang. Your sticky face squished against the wooden surface, leaving a messy imprint. Your brain ached in your skull, leaving you dazed as Rhea stood behind you, reaching around to undo your belt. Your hands shot towards your waist in an effort to stop whatever she was doing, but it was no use. Her arms tensed and flexed their impressive muscles, overpowering your comparatively weak grip. Your wrists were clutched in Rhea’s hands, she slapped your hands down on the table and resumed unbuckling your belt. She pulled your pants and briefs down to your ankles, you knew exactly what she was doing.<br>“Please...” you begged “anything but that...” your voice ragged and hoarse. “I’ll do anything...” you nearly sobbed.<br>Rhea leaned down, putting her lips right on your ear.<br>“Oh no no no... this is the only thing you have that I want. Best to just try and enjoy it.” She whispered before nibbling your earlobe. <br>Rhea straightened herself up, grabbing hold of your hip with one hand. Her other hand stroked back and forth a few times on her immense rod, still soaking with your spit. You felt the head of her red-hot penis press roughly against your clenched asshole. With a grunt and one mighty thrust, Rhea’s cock was jammed into you. <br>You tried to scream but couldn’t even produce a sound. Your back arched, your fingers scraped on the table as your mouth hung wide open in shock and pain. Your ass felt like it was being split open, and all she’d forced inside of you was the head. You heaved each breath in agony as she put both hands around your waist and clamped down. Pulling you towards her hips, her thick cock slowly squeezing in, stretching your tight entrance. Your whole body began to feel full as inch after agonizing inch of Rhea was plowed inside your body. You began to groan as the searing pain in your rear end became too much to bear. Your whole body was racked with anguish as the well endowed Aussie continued forcing you to accept her entire massive cock. Finally. Mercifully. You felt her groin and hips softly bump against your trembling cheeks. Her plump testicles swung gently into yours. Rhea sighed, satisfied with her conquest. <br>“Unnhhh...yeah.” She moaned. “Hardly anyone can take me balls-deep the first time.”<br>You felt her third-leg throb inside of you. Then Rhea began to remove her engorged sledgehammer of a cock from your bowels. You felt your guts squeeze themselves back to normal size as she withdrew. The relief after being stretched wide open felt incredible, but you knew it wouldn’t last. Ripley pulled out until only an inch was left inside your ass. You managed to utter a limp <br>“Oh god...”<br>“Yeah. He can’t help you now.” Your assailant taunted before she gave a powerful thrust, filling your insides with her meat once more.<br>You screamed out as Rhea bottomed out in you again, her hips crashing into your ass with a thud. Your jaw hung open, and your eyes opened wide as the unbelievable amount of thick cock was repeatedly pulled back and pounded into you. Each thrust forcing a “G’uh...!” sound out of your throat involuntarily. You felt like your stomach was about to be penetrated by Rhea’s huge spear. You let your head fall back down to the table, there was nothing you could do to stop Rhea from ravaging your helpless ass. Her shaft pumped like a machine in and out of your body, a wet, squishy sound filling the room as Ripley churned your guts with her rock-hard fuck-pole. Your ass clenched around her girth, making it feel like each thrust would pull you inside-out. Your face slid back and forth on the table surface, smearing the congealed ejaculate on your cheeks across the smooth, shiny wood. Rhea huffed and growled like a beast in heat as she treated you like a toy, showing no signs of slowing down the anal assault. Your mind began to cloud as the pain started to become dull. Rhea was now bent over, her chest resting on your back, hands planted wide on the table. Her thrusts became smaller and faster, her swollen balls slapped into yours again and again, a sensation you almost started to enjoy before she planted her penis fully within your ass and left it there. You took this time to recollect your mind but it was only a moment before Ripley put her large hands around your waist again but she stepped away from the table, taking you with her. You began to swing your legs, desperately searching for ground to run on, but the brutish blonde gripping your body held you in the air, still impaled balls-deep on her mighty instrument.<br>Rhea bent her knees, widened her stance and began to lift your whole body, against your will, up and off of her pulsing hard-on. She then slowly let you slide back down, your body shuddered as you were hoisted up and down. Rhea began to speed up her fucking. Your pulverized asshole now being used as a cock-sleeve. It felt like hours were passing as you moaned towards the ceiling with your rear end wrapped tightly around a long, thick, throbbing, veiny, musky dick. You couldn’t believe what was happening, you were being carried around like a doll and mercilessly, heartlessly pounded in the ass by a fiercely strong woman. Her chiseled body gleaming with sweat as she continued using your ass to satisfy her animalistic lust. Rhea’s arms began to quake, she brought you down to your feet, still humping into you with all her might. Your ass was going to be bruised, you thought. You couldn’t stand on your own two feet at all though, so you reached for something, anything, to stop you from dropping onto the hard ground. You felt the metal door on your palms, you looked up at it like it was your saving grace.<br>“Someone...! Help me!!!” You shouted as loud as you could muster. The sounds of a packed arena cheering on other performers was muffled from in here, but you knew that nobody could hear you from outside the room. Tears began to well up in your eyes as Rhea’s ramrod plunged your aching hole relentlessly.<br>Then Rhea started to giggle, she reached over you and unlocked the door.<br>You were stunned.<br>“Go on. Open it.” She gasped between thrusts. “Open that door and let everyone see you getting your ass fucked by a woman!”<br>You placed a hand limply on the door handle and whimpered. It was your only chance to get free. “Yeah that’s right.” Rhea continued to mock you. “If you want the world to know you get a stiffy from being fucked up the ass then be my guest.”<br>What?<br>Rhea planted her feet firmly and wrapped one arm around your waist and her other around your neck. She squeezed around you like a constrictor and pulled you up straight. Looking down you saw she was right, your penis was standing fully erect. Amidst the pounding and numbing pain, you hadn’t even noticed that your body had become aroused by the flurry of sexual sensation. Wether you wanted this or not, you were now painfully aware of Rhea’s thick shaft rubbing against your prostate, sending a tingling sensation through your dick and balls. ‘Oh fuck’ you thought ‘this can’t be for real’ as you stared down at your own bouncing member, you could swear you saw your stomach bulge out with each thunderous penetration. On the back of your neck, Rhea’s warm breath made your hairs stand up on end. She mumbled to herself, eyes rolling back in her head.<br>“Unnhh-uhh-guuhhhh...” she moaned, slamming into your backside several times before pulling nearly all the way out and stuffing herself in one long, smooth stroke right down the to the base of her shaft. You could feel her full testicles slide up on yours as they retracted. Her penis pulsed and expanded inside of you as a gush of steamy hot love gel was pumped into your guts. The feeling of warm, thick streams of cum being blasted into you awakened something within you as your own painfully erect cock began to fire off its own orgasm. The two of you pulsing and ejaculating in tandem, your sex noises mingled in the air into one harmonious moan. After Rhea had finally drained her heavy balls and made you her unwilling cum dump. She brought you back over to the table and laid you down on it. Gently sliding her hammer out of your busted asshole with a squelch and a pop. You cried out as the feeling of something so big sliding out of your body made you feel like you had just vacated yourself on the table. You lay on your back while hot seed flowed from your rear end, onto the table. Rhea took a moment to just stare at you, cowering before her strength. Her dick soon returned to full length. Looking at her now you were amazed you had survived a fucking that brutal from an instrument that large. It must’ve been nearly a foot long! She sauntered over to you on the table, her wo-manhood bouncing with each step. You knew your fate was sealed long ago, so you wordlessly nodded, raised your feet up in the air and presented your pulverized ass to Rhea. You were hers for the taking now. Nobody could stop her. The Australian behemoth grabbed your ankles in her mighty hands. As she lined her horse-like appendage up to your tender, winking hole, a voice on the arena’s loudspeakers rang out.<br>Here are your winners. The WWE Women’s Tag-Team Champions; Nikki Cross and Alexa Bliss!<br>“You’re lucky.” Rhea said with a smirk. She let go of your legs and backed off. She reached into her duffle bag and produced a towel. Quickly wiping down her still stiff cock and thick balls, she then tossed the towel onto you. <br>“Clean yourself off, maybe I’ll see ya’ around.” She laughed to herself as she left. </p><p>You limped on numb legs out of Rhea Ripley’s private locker room. You were worried someone would notice you were walking like you’d just been rammed up the ass by an angry woman with a foot-long fuck-machine tucked in her pants. People rushed by, paying you no attention while you leaned against the wall to keep steady. You were met at last by the perfect face of your goddess, Alexa Bliss. She looked relieved to see you, a new expression as far as you could recall. She smiled at the sight of you and asked <br>“Did you deliver my note?”<br>“...yeah.” You squeaked.<br>“How did she take it?”<br>“Good.” You quickly replied, eager to get out of here and curl up under a blanket for a long time.<br>“Let’s get you out of here.” Alexa said in a soothing tone, placing a hand on your cold cheek. “Poor thing. She must’ve scared you half to death.”</p><p>Oh Alexa. If only you knew.</p></div>"}
{"work_id": "23778280", "text": "<div class=\"userstuff\"><p class=\"western\">The afterparty is packed with students and alumni, and their parents and families. Crowley hasn't changed much, except to fasten his hair out of his way with a black velvet band, and he can almost pick out every nonbinary student by the mingled looks of yearning and envy that they wear looking at him and his outfit. Some of the parents on the other hand... Crowley slides his chair back until it hits the wall behind him, so no one can surprise him from behind. When he looks up again there's a kid in front of him wearing a tentative smile. A real kid, surely no more than 10 or so.</p><p class=\"western\">\"Do you remember me?\" she asks.</p><p class=\"western\">He does recognise her, for all she's so much older, taller, and happier now, but he doesn't know what name she goes by these days, and doesn't want to guess. \"You hid in my greenhouse,\" he hazards, and she beams with delight. \"You'll have to remind me of your name, I'm afraid.\"</p><p class=\"western\">\"Oh! I'm Isabel these days. Still Izzie for short though!\" She folds her hands in front of her. \"And what do I call you?\"</p><p class=\"western\">\"You call me Dr Crowley,\" he tells her without so much as a blink. \"And use he/him pronouns.\"</p><p class=\"western\">Her face lights up. \"Thank you. I mean - thanks for everything.\" She ducks away into the crowd before he has a chance to respond.</p><p class=\"western\">\"Not even a grumble about being thanked?\" Anathema says, sliding into the next chair.</p><p class=\"western\">Crowley turns with a mock grimace badly disguising affection. \"Yeah, well, Angel'd get seriously disappointed at me if I caused any trouble, 'cause it'd drag him away from the buffet.\"</p><p class=\"western\">\"Oh, well then. Can't have that.\" Anathema grins at him, not fooled at all. \"Better now it's over?\"</p><p class=\"western\">\"Some,\" he admits, and adds almost grudgingly, \"thanks.\"</p><p class=\"western\">\"No problem.\"</p><p class=\"western\">Crowley sighs, and slouches back against the wall, too tired and sore to bother even trying to sit normally. What he wants to do is go home and sleep for a week, but he'll be lucky, he knows, to get more than tomorrow to rest. For now, he's stuck at this too-loud, too-bright, too-crowded party until Aziraphale's ready to go. Which...he cranes his neck a little to see the buffet table...isn't likely to be soon.</p><p class=\"western\">Anathema asks, \"Can I get you anything?\"</p><p class=\"western\">\"Nah. He'll bring a plate over when he remembers. Appreciate the thought though.\"</p><p class=\"western\">She nods, and moves off into the crowd, her black lace dress swirling around her ankles.</p><p class=\"western\">Movement close by catches his eye and he spots one of parents forging towards him with an expression that promises trouble. He smooths his skirt over his knee and leaves his hand resting protectively there as the man launches into a hissed rant about corrupting the youth.</p><p class=\"western\">Crowley gives him a minute or two, then clears his throat. \"I think you're under a misapprehension. Corrupting the youth is not of interest to me. It's hardly even a challenge. I vastly prefer people my own age and maturity. <em>Much</em> more interesting.\" A taunting smile flickers just barely across his face as he meets the man's gaze.</p><p class=\"western\">The man splutters, going scarlet, and bolts, almost knocking into Aziraphale.</p><p class=\"western\">Aziraphale rescues the plates of food just in time, and huffs, \"Really, some people just don't have any manners.\"</p><p class=\"western\">Crowley greets him with a tired, brief, but tender, smile. \"Is one of those for me?\"</p><p class=\"western\">\"Of course. All your favourites.\" Aziraphale smiles back at him and folds himself neatly into the same chair Anathema used. He passes over the appropriate plate and settles back to consume his own portion with a look of bliss.</p><p class=\"western\">Crowley takes the plate and pops a bite of soft cheese and pineapple into his mouth, followed by cake so light it practically dissolves on the tongue. He's finished long before his angel is, and just watches him, drinking in the look on his face as if it were as delicious as the cake itself.</p></div>"}
{"work_id": "23813053", "text": "<div class=\"userstuff\"><p>Remus was going to kill Peter. Peter knew that Remus hated clubbing, he knew that Remus felt inexplicably stressed when inside of a nightclub due to the strobing lights, and the drinks being spilled on him, and the fact there was no space to move. But still, Peter insisted that Remus came out with him because <em>“It’s New Year’s Eve Remus, you need to live a little!” </em>and so, here he was. Clad in a bottle green knitted jumper that was oversized, light blue jeans that were rolled up at the cuff, and his no-longer-white Chuck Taylors. His curled golden brown hair was resting on his forehead, <em>just </em>covering his eyes in a way that meant he could see perfectly but it still provided him with a way to stay hidden from the world. They walked to the club, puffs of breath clouding out in front of them as the December chill nipped at their cheeks, turning them a blushed pink.</p><p>“I think Lily and James are coming tonight, they asked James’s parents to watch Harry for the night. You remember them right?” Peter’s head cocked to the side as he looked to Remus.</p><p>“Yeah I remember them. Lily’s the redhead with bright green eyes, and James is the one with glasses who looks like he can’t believe he’s going out with her, right?” The smaller boy snickered.</p><p>“Yep that’s them, very accurate description Rem.” Remus chuckled along with Peter, realising that he was glad Peter had dragged him out. Otherwise, he would be sat in his and Peter’s flat on the sofa, reading a book and piling chocolate into his mouth. <em>Yeah, this should be a good night. </em></p><p>They reached the club and entered after about 10 minutes of queuing outside. It was relatively quiet inside the room, the dance floor empty enough to actually be able to dance without bumping into another person. Peter headed straight for the bar with Remus in tow, both ready for a drink. While Peter ordered just a pint of their cheapest cider, Remus opted for a double vodka-coke, the quickest way to get him pissed and relatively cheap. As he waited for the bar tender to make his drink he turned around to lean on the bar, facing out to the crowd that was slowly but surely getting bigger. He skimmed the room and was about to turn back around when he caught sight of the most beautiful man he’d ever seen. Shoulder length jet-black hair framed a chiseled face, grey eyes sparkling from underneath the few tendrils that fell over them. Remus’s eyes dragged down the man’s body, taking in his <em>The Clash </em>t-shirt, skinny black jeans, and ox-blood Doc Martens. The man looked to be a few inches shorter than Remus, not like that was hard when he was so gangly. <em>Jesus Christ he is gorgeous. </em>Remus was brought back to the present when he felt a tap on his shoulder, turning to see the bartender holding out his drink to him. Thanking him, Remus took the drink and looked to Peter who’s eyes were trained in the direction of the God-like man Remus had just been admiring.</p><p>“James and Lily are over there, shall we go join them?” Remus looked a little bit to the left of Mr model to see the redheaded girl he had met before stood beside her bespectacled boyfriend who was talking animatedly.</p><p>“Yeah sure!” He pushed off from the bar and walked alongside Peter, skillfully weaving in and out of the crowd to avoid spilling his drink. They reached James and Lily, Remus smiling timidly at the two of them due to not really knowing them all that well.</p><p>“Peter! And Remus, right?” James turned to Remus after hugging Peter, holding out his hand in a friendly handshake.</p><p>“Yeah, nice to see you mate.” Remus took his hand and shook it. “And you Lily, nice to see you again.”</p><p>“It’s lovely to see you Remus.” She stepped forward, pulling Remus into a short but tight hug. He had forgotten how friendly Lily was in the time they had spent apart since their last meeting, she would always make everyone in the room feel at ease and welcome; she was just so uncommonly kind like that.</p><p>“Is that Peter Pettigrew himself I see in front of me?” A low voice came from over Remus’s shoulder, it was laced with playfulness and Remus felt himself smirk at it.</p><p>“Sirius! How are you mate?” The gorgeous black haired man from earlier hugged Peter tightly, patting him on the back twice before pulling away. Remus felt a twinge of jealously and longing, why couldn’t <em>he </em>be the one being held by such a beautiful man? Though to be fair, he wasn’t entirely sure he’d be able to stop at hugging should be ever find himself tangled up with him. Remus’s cheeks flushed at the crude nature of his thoughts and took a large sip of his drink to avoid making eye contact with anyone.</p><p>“I’m not bad mate, not bad. What are you doing here then?” Remus’s eyes were focused on the raven-haired man’s back, definitely <em>not</em> noticing the way his muscles flexed through his t shirt as the man lifted his arm to take a sip of his drink.</p><p>“Oh I’m here with my friend Remus, don’t think you two have ever met have you?” Remus watched as Sirius turned around, feeling the wind get knocked out of him as he noticed how his grey eyes looked like pools of mercury up-close. Sirius’s face broke out into a wide smile as his eyes traipsed over Remus’s face and body.</p><p>“No I don’t think we have Pete, I’d definitely remember a face like that.” Sirius winked at Remus then held out his hand, inviting him to a civilised handshake like he hadn’t just shamelessly flirted with him. The golden-haired boy’s cheeks flushed as he placed his hand in Sirius’s, not missing the warmth it sparked within him. “It’s nice to meet you Remus.”</p><p>“Yeah it’s nice to meet you too Sirius.” Remus grinned widely at Sirius, the raven-haired man’s cheeks had flushed lightly when Remus’s hand met his own; and Remus had managed to catch the pink darting through the usually pale skin. <em>Well at least I’m not the only 21 year old man who still blushes like a school girl. </em>The two men looked to the rest of their group only to find them in a deep conversation about little Harry, James gushing about the fact that Harry’s first word was ‘dada’. Sirius looked at Remus and rolled his eyes playfully, making him giggle lightly as he finished his drink.</p><p>“I know I’m the kid’s godfather and I adore him, I really do, but Jesus Christ those two never shut up about him. Like he’s cute we get it, can’t you just get pissed with your mates without mentioning him all the time?” Sirius chuckled as he spoke before allowing himself a loud, barking laugh while Remus laughed along.</p><p>“I think the only time I’ve ever seen Harry was when he was 6 months old, he is pretty cute I have to admit.” Remus remembered holding the small child in his arms, pulling faces to try and get a giggle out of him. It had worked, Harry let out a hearty little laugh once Remus had crossed his eyes and stuck his tongue out; it was the cutest sound in the world.</p><p>“Oh god yeah, he’s a little heart-stopper. Definitely takes after his Uncle Sirius.” Sirius winked at Remus and he grinned. “You should see him now, he toddles all over the place now that he can walk. It’s so cute.” Sirius smiled fondly at the thought of his godson and Remus felt his heart melt, what he would do to see Sirius running around after little Harry.</p><p>“Oh bless him, Pete and I will have to visit soon.” Remus nodded to himself as he spoke, almost confirming that he will do that. <em>I’d be there every single day of the week if it meant that I’d see you. </em></p><p>It was as if mentioning Peter’s name summoned him, because out of nowhere he arrived with two drinks in one hand and a tray with 5 shots in the other. Peter handed Remus his double vodka-coke as well as what looked like a shot of tequila for him and Sirius before turning back to James and Lily. The two men clinked their shot glasses together before tipping it down their throats, both grimacing at the burning as it went down. Remus shook his head as if to shake off the feeling before taking a long sip of his drink.</p><p>“Yes you will, I’ll have to make sure I am around on that day.” Sirius’s voice was flirty and he cast a glance at Remus that nearly floored him, it was like Sirius was undressing him with his eyes. Sirius looked at Remus intently, drinking in his appearance. He took in his curly golden hair and wanted nothing more than to run his fingers through it, he looked at the freckles dusting the bridge of Remus’s nose and his cheeks that made their own little constellations and felt the urge to kiss every single one of them. The way Remus’s cheeks were flushed pink all the time made Sirius want to do filthy things to him just to see how dark he could make those cheeks go. He found Remus’s oversized jumper absolutely adorable and relished in the way swallowed him whole. The bottle green of the jumper complemented Remus’s hazel eyes perfectly, and as Sirius looked into them he could see the little flickers of gold swimming around.</p><p>“And why would that be, Sirius?” Remus smirked at Sirius for the first time, his eyes glinting from underneath the perfect ringlet that was dangling over his eye and Sirius felt it go straight to his cock because <em>fucking hell it should be illegal for someone to look like that. </em>Remus, feeling confident, took a step closer to Sirius, pushing his hips forwards slightly in a feeble attempt to feel the other man’s thigh pressed against his own.</p><p>“Wouldn’t you like to know, Remus.” Sirius took a step forward, hips forefront, and closed the gap between his own and Remus’s thigh. Their legs collided, the denim from their jeans muffling some of the heat radiating off their bodies. Remus leaned in to Sirius’s ear, breath tickling down the raven-haired man’s neck.</p><p>“I really would.” When Remus pulled away, he bit his lip and watched as Sirius blushed at his words. He took another sip of his drink, feeling the alcohol buzzing through his veins in just the right way to relax him but not completely unhinge him.</p><p>“Fancy stepping outside for a smoke?” Sirius’s eyes were hopeful but Remus saw the flicker that made him realise Sirius’s intentions weren’t entirely innocent.</p><p>“Sure, lead the way.” He gestured for Sirius to walk in front of him, and watched as Sirius made a gesture to James that let him know they were going outside. The raven-haired boy grabbed onto Remus’s hand and pulled him through the crowd, it was absolutely packed now so he made sure to keep a secure grip on Sirius’s hand to avoid losing him in the mass of people. The crisp, cold night hit Remus square in the face and he a took a breath of icy air, allowing it to fill his lungs and wake him up. He followed Sirius around a corner in the smoking area to find a completely deserted dead-end. Sirius patted around in his pockets, finding his slightly crumpled carton of cigarettes and plucking one out of it, placing it between his teeth to free up his hands. Remus copied his actions, taking one of his own cigarettes and holding it with his lips to keep it in place while he attempted to find his lighter. He finally found it and brought it up to his face, igniting it and placing the flame to the end of his cigarette, bringing it to life. Sirius was still looking for his lighter so Remus placed his hand on his arm in an attempt to stop the boy’s searching. Taking the hint, Sirius leant forward and let Remus light up the end of his cigarette. Remus watched as Sirius’s features were washed with a flickering orange as the flame danced from the lighter. The way his sharp cheekbones stood out against the rest of his shadowed face made Remus go weak at the knees, he really was a fucking handsome man. Sirius pulled away once his cigarette end was lit but then shuffled his body closer to Remus, allowing their shoulders to bump into one another and their free hands to entwine with each other. The two of them remained silent for a few minutes, just happily listening to the music from the club in silence. Remus finished his cigarette first, crushing the butt-end underneath the sole of his Chuck Taylor. He then turned his whole body to face Sirius, balancing on his shoulder against the wall so he could look at the other boy’s face, watching his cheeks hollow as he took a pull of his cigarette.</p><p>Sirius turned his head to the side to look Remus in the eyes, blowing smoke out of the side of his mouth. The golden-haired boy watched as Sirius took another drag of his cigarette, thinking he could make even the simplest of tasks look sexy. Sirius leaned forward and placed his lips against Remus’s open ones, Remus closed his eyes and relished the feeling of the other boy’s lips against his own. Sirius blew the smoke from his own lungs into Remus’s mouth as their lips moved against each other, making the taller by shiver at the taste of Sirius. They pulled away for a moment, Sirius taking one last drag of his cigarette before stubbing it out against the wall and throwing it aside. Remus opened his eyes to watch Sirius breathe out the remaining smoke in his lungs, his eyes raking up and down’s the golden haired boy’s body. Sirius lifted one of his hands and placed it on Remus’s shoulder, then he pushed the boy so he was stood flat against the wall. The taller boy rested his head against the cool brick, breathing heavily as Sirius shifted his hips so they hovered over Remus’s- not quite touching but close enough to feel the heat radiating from the skin underneath his black skinny jeans. Sirius’s hands were placed either side of Remus’s head, holding himself up as he raked his eyes over the boy’s freckle speckled face.</p><p>He slowly lowered himself down until his lips met Remus’s once more. Straight away Remus placed his hands on Sirius; one on the back of his neck wound in his black hair, and the other on his hip- under his shirt where it had ridden up and allowed Remus a tiny sliver of bare skin. Sirius, on the other hand, gave into his intrusive thoughts and placed one hand in Remus’s soft curls, raking his fingers through them while his other lightly cupped his cheek; thumb slowly stroking back and forth over the flushed pink skin. As they continued to kiss, the tension between them built considerably. Remus bucked upwards in an attempt to close the gap between his own and Sirius’s hips, wanting to feel the heat of Sirius pooling through the barriers of their jeans. Taking the hint, the raven-haired boy pinned Remus to the wall with his hips, swallowing the gasp he let out at the sudden contact. Sirius felt Remus lick along his bottom lip and opened his mouth to let him in. Their tongues slid against each other as they drank each other in, alcohol coursing through their veins and giving them both a buzz that only spurred them on. Sirius began to grind his hips into Remus’s, feeling the other boy push up into him. Their mouths separated and the raven-haired boy kissed along the freckled nose in front of him, slowly dragging his lips along Remus’s jaw. His kisses travelled down the other boys neck and Sirius stopped to suck on his pulse point, Remus moaned aloud and bucked his hips into Sirius’s with force sending a jolt of pleasure into both of their cocks. Sirius continued sucking that place on his neck, clearly happy with the reaction he’d gotten out of the other boy. He ground his hips particularly roughly into Remus’s while grazing his teeth over his pulse point, creating a perfect purple bruise that he soothed with his tongue. Before he even realised what had happened, Sirius found himself pinned to the wall with Remus pressed closely to his front. Remus’s lips were attacking Sirius’s, sucking his bottom lip relentlessly while bucking his hips into the shorter boy’s, relishing in the way Sirius attempted to push his waist forward to meet Remus halfway. Remus stopped pulling his hips away and instead placed his crotch directly over Sirius’s, looking deep into his mercury eyes to make sure this was alright. It was almost as if he knew what he was about to do- despite no words being said- because Sirius nodded vigorously, telling Remus he most definitely wanted this. Their clothed cocks pressed against each other as Remus began grinding against Sirius, constantly pushing into him to try and relieve his painfully hard erection. Remus moved his head, sucking on Sirius’s neck in different places trying to create as many hickeys as possible; feeling spurred on by the heavenly noises he was making.</p><p>“Fuck Remus, you are so good.” Sirius’s hands found their way to Remus’s arse and he squeezed over the material of his jeans. Remus relished in the feeling of Sirius’s hands on him and ground his hips harder into him. They continued grinding against each other until finally, Remus felt like he was going to tip over the edge any second and he was sure Sirius was right behind him. “Fuck, fuck, fuck.” Sirius let out a moan almost like a howl as he came in his jeans, still bucking his hips up to meet Remus’s. The sound of Sirius cursing tipped Remus over the edge and he groaned as he orgasmed.</p><p>“Jesus Christ Sirius.” He stopped rutting into him and rested his forehead against the shorter boy’s, both of them breathing heavily in an attempt to get their breaths back. He kissed Sirius’s lips lightly before pushing himself up off the wall, his cheeks flushing with realisation at what he had just done. <em>I just had public sex. I just had public sex with probably the best looking man I have ever seen in my life. </em>Remus began to laugh, quietly at first but eventually it all became too much and he had tears leaking from the corners of his eyes due to how much he was laughing.</p><p>“Remus- what?” Sirius was chuckling too, but he had a slight tone of confusion as he looked at the boy stood in front of him.</p><p>“We just had a quickie in a dingy beer garden, on the first night we met. On <em>New Years Eve</em>.” He finished his sentence then burst into a fit of giggles once more, only this time, Sirius was properly laughing along with him.</p><p>“Honestly Remus that was the hottest thing I have ever done.” Sirius couldn’t keep the smile from his face, it was true. He’d had his fair share of one night stands with men who were simply there at the right place, right time and smirked in <em>just </em>the right way to make Sirius feel a bit weak at the knees. <em>However,</em> what he had just done with Remus was a result of pure attraction to him. He couldn’t even hold down the lust that was coursing through his veins, hell, he’d felt his cock twinge as soon as he set eyes on Remus when he was introduced to him by Peter.</p><p>“The way you say fuck is <em>obscene</em>.” Sirius arched his brow. “Jesus Christ if you do that every time you get riled up I don’t think I’ll be able to hold myself back.” Remus closed his eyes as he remembered the way Sirius sounded when he cursed; the breathless, almost whiny tone of voice as he enunciated every single letter of the word. That would definitely be a thought to use when he got himself off that night.</p><p>“I can’t help it Rem, you’re just so <em>fucking </em>irresistible.” Sirius let the word roll of his tongue slowly, smirking as he saw the way Remus gulped at the sound of it. “Anyway we should probably go back inside, it’s 11 o’clock.” He held Remus lightly by the sides of his face, kissing him once more before allowing the taller boy to step backwards. They connected hands once more and made their way back inside the busy club, navigating the crowd and finding Peter, Lily and James all dancing on the side of the dance floor. James and Lily were both dancing with each other, seemingly lost in their own world while Peter was dancing with a pretty girl with blonde hair. <em>Go on Pete. </em>Remus turned to Sirius and grinned at him, feeling the raven-haired boy pull him close so they could dance together. As they danced close to each other, James finally tore his eyes away from Lily to acknowledge the two boys’ presence.</p><p>“Alright Pads?” James’s eyes went straight to the hickeys that were blooming on Sirius’s neck and he smirked knowingly; he’d had a feeling that Remus and Sirius would get along well when James met Remus.</p><p>“Yeah Prongs, I’m grand.” Remus could feel Sirius’s arm snake around his waist and pull him closer, dancing to the song with Remus pressed against him.</p><p>“Pads and Prongs?” Remus looked at Sirius with a confused expression, not really understand the meaning of their respective nicknames. The shorter boys eyes glinted with fondness, almost like he was happy Remus asked because he enjoyed telling the answer so much.</p><p>“Basically I call him Prongs because when I met him on the first day of year 7 his hair was so unruly he actually looked like he had deer antlers sticking out of his head.” Sirius chuckled. “Honestly Remus, his hair was so fucking ridiculous; NOTHING would tame it, and I mean nothing because lord knows we tried everything.” Remus laughed, throwing his head back; Sirius tried not to notice the purple bruise blooming on his neck where his lips had been just 20 minutes previously. &nbsp;</p><p>“That’s brilliant! And what about you, what does Pads mean?” The freckled boy quirked an eyebrow as he questioned Sirius.</p><p>“Well when I first hit puberty, the only thing that happened was that my feet grew. Literally for months nothing happened except that my feet went from a size 5 to a size 9, it was awful. I looked so bloody stupid being about 5 foot tall with size 9 feet. So James took to calling me Padfoot as a piss take at first but then it sort of became an affectionate term of endearment so it stuck. We’ve been Padfoot and Prongs for a good 10 years now, and our teachers feared those names.” Sirius laughed when Remus pulled a horrified face. “We caused absolute <em>havoc </em>at school, constantly pulling pranks and such. We actually went to school with Lily but she despised us back then due to disagreements about her friend. The two of us had a right laugh though, always in detention for something or another. Our head of house Minnie used to get so sick of seeing us in her office, but she secretly loved us really.” A fond smile spread across his face at thinking about his school days.</p><p>“Wow. Your high school experience sounds a lot more eventful than mine, I can tell you that. I spent most of my time in the library at school unless Pete could convince me to come hang out with him and his mates. I was a pretty boring kid, not that I ever grew out of the reading or the shyness.” Remus’s cheeks flushed as he spoke, <em>God I am a bit of a nerd really. Why the hell would someone as exciting as Sirius be interested in me? </em></p><p>“You sound like the kind of kid I would’ve loved.” Remus was shocked at Sirius’s statement.</p><p>“Really?” He didn’t miss the glint of mischief that flickered in Sirius’s eye and braced himself for another cheeky comment that would no doubt be dirty.</p><p>“Yeah, really, the quiet, bookish ones are always the best at planning successful pranks. Also,” Sirius moved so his mouth was right next to Remus’s ear, allowing him to whisper. “The shy ones are the loudest in bed, and you know how much I <em>fucking </em>adore your moaning.” Sirius lightly tugged Remus’s earlobe with his teeth as he pulled away, feeling the shiver that ran through the taller boy’s body as he did so.</p><p>“Jesus Christ.” Remus’s voice came out as a breathy gasp, the way Sirius cursed really was the sexiest thing in the world to him. He cleared his throat, determined to not give Sirius the satisfaction of reducing him to putty in his hands at a simple word. “What would my nickname be?”</p><p>“Hmm let me think.” Sirius pondered the question for a minute, the two of them still dancing closely to the music. “Moony.”</p><p>“Moony?” Remus raised his left eyebrow, something Sirius noticed he did when he was entertained by something someone had said.</p><p>“Yeah Moony.” Sirius nodded, as if confirming the nickname to himself. It rolled off his tongue in the just the right way.</p><p>“Why Moony?” Their hips swayed side to side with each other, hands on the other’s body. Remus’s hands were on Sirius’s lower back and it was taking a lot of will power to not let them drift downwards, whereas Sirius’s were gripping Remus’s hips to hold them in place. Sirius gave Remus a grin that was laced with playfulness and he knew straight away that he would regret asking that question in some way. &nbsp;</p><p>“Because you turn into a wild animal at nightfall. I would use the phrase hungry like the wolf but as it turns out, I’d quite like to shag you again and I feel as if that phrase would deter even the horniest of men.” Sirius winked at the other boy and enjoyed the loud laugh that fell from his lips.</p><p>“Moony it is then. And thank god you didn’t say ‘hungry like the wolf’, I think you’re fit as fuck but that would have seriously dented the appeal.” Remus grinned at Sirius which the other boy reciprocated.</p><p>“You know, <em>Moony,</em>” He emphasised the use of Remus’s new nickname, “You talk a good game about the way I say fuck, but you give me a run for my money. I could listen to you curse all night.” Sirius’s eyes darkened as this thoughts were infiltrated with the idea of Remus cursing over and over while Sirius was on his knees in front of him. <em>Fucking hell I need to stop thinking about this. </em>Sirius shook his head to clear his mind of such inappropriate thoughts, and it almost worked until Remus bucked his hips into Sirius’s and leant in to whisper into his ear.</p><p>“I think I’d like to take you up on that offer.” Remus ran his tongue around the shell of the other boy’s ear before kissing across his cheek, eventually placing his lips onto Sirius’s. They stayed, lips locked, for a few minutes before the DJ in the club made an announcement over the music.</p><p>“Alright you guys, it’s 11:55! Who is ready to bring in the new year the right way?” The crowd cheered in response and the group of 5 (plus the blonde haired girl) all looked at each other with excitement. “Okay the countdown will begin at 11:59, so I want to hear you singing as loud as you can to this next song.” The DJ pressed a button and ‘Come On Eileen’ started playing throughout the club. The crowd started dancing; Remus, Sirius, Lily, James, Peter, and the girl (whose name was Mary) all formed a circle so they could see each other. They jumped around and danced with their arms in the air, singing at the top of their lungs. The song finished as the countdown was at 20. 20 seconds until a new year and Remus couldn’t wait to see what it brought his way.</p><p>“10, 9, 8…” The crowd were shouting, people grabbing onto their loved ones as the prospect of spending another year with them left a buzz in the air. Lily had turned to face James, Peter had his arms circled around Mary’s waist, and Remus turned to Sirius.</p><p>“5, 4..” Sirius was only whispering as he leaned towards Remus, the other boy doing the same. The countdown hit 1, the clock turned <em>00:00</em>, and Remus’s lips collided with Sirius’s. They wrapped their arms tightly around one another and let their lips move against each other. Sirius opened his mouth, welcoming Remus’s tongue inside, feeling it slide against his own in the most perfect way. Reluctantly, they pulled away from each other, breathing deep in an attempt to get oxygen back into their lungs. The smile on Sirius’s face set off sparks in Remus’s nerve endings and he felt the tiny shots of electricity flitting through his body as his own mouth widened into a toothy grin.</p><p>“Happy New Year Sirius.” His eyes sparkled in the strobing lights of the nightclub, making the flecks of gold glint as if they were liquid.</p><p>“Happy New Year Remus.” Sirius placed his forehead against Remus’s, feeling utter content swimming through his veins. He felt a tap on his shoulder and turned around to see James stood behind him, grinning broadly.</p><p>“Happy New Year mate!” James pulled Sirius into a tight hug, patting him on the back.</p><p>“Happy New Year Prongs.” They pulled away from their embrace, James placing his arm around Sirius’s shoulder as he rested his head atop of the other boy’s.</p><p>“Happy New Year Sirius.” Lily balanced on her tip toes to press a kiss to Sirius’s cheek, him pulling her into his chest to hug her. He couldn’t be happier that his best friend ended up with such an amazing girl. He looked to his left to see Remus and Peter locked in a tight embrace and smiled. They pulled away and Remus made his way to Lily, having already hugged James before Peter. She pulled the tall boy into her arms and squeezed him tightly, Remus’s grin widening as he caught Sirius’s eye.</p><p>“What do you say Jamie, do you reckon we have room in our group of 3 for two more misfits?” Sirius spoke loudly so Remus and Peter could hear him, both of them realising what he was saying.</p><p>“You know Sirius, I think we can make room.” James smiled at Remus and Peter, nodding his head at his best friend. Sirius took Remus by the arm and pulled him flush against his own body, clasping his hands around the other boy’s back in a bone crushing hug that Remus reciprocated.</p><p>“This is going to be a fucking good year, Moony, I hope you’re ready.” Remus looked down at Sirius, content written all over his face.</p><p>“With you by my side, I think I’m ready for anything Pads.”&nbsp;</p></div>"}
{"work_id": "23785069", "text": "<div class=\"userstuff\"><p>It was <em>way</em> too quiet.</p><p>Not that Tony was complaining since he had come back from a day full of meetings and he was tired...but as he looked around the penthouse, he saw no one. Absolutely no one. No Stephen (who he knew wasn't dimension hopping at the moment), no kids causing some sort of chaos, and no avengers. It was silent.</p><p>It was unnerving instead of relieving like he thought it would be.</p><p>Maybe Stephen and Valerie were taking a nap? It was a very rare occurrence, but if Stephen had a more hectic day than usual, he was known to actually take twenty minutes for himself. Tony decided he'd check the bedroom first before asking Friday where everyone was. If Stephen was napping with the baby, Tony would be inclined to join them. When he climbs the stairs tiredly and opens the first door he came to though…</p><p>His mouth went dry and his cock stirred to attention when he saw what was waiting for him. Stephen was clearly not napping. No. His tease of a wife was reclined against the pillows in nothing but one of Tony's overly large silk shirts. Specifically the midnight blue one that covered the sorcerer just so and left little to the imagination. The sorcerer looks up at him from the truffle that was dripping chocolate all over his hand and--<em>dear god</em>--his thigh and Tony could only watch with growing arousal. Exhaustion? What exhaustion? Just seeing Stephen like this made him feel twenty years younger.</p><p>\"Welcome home.\" Stephen purrs before popping the last bit of chocolate into his mouth.<br>\nWhen Stephen starts to lick his fingers clean of melted trails of dark chocolate, Tony finally starts yanking his tie off. \"<em>Sto per divorarti.</em>\"</p><p>Blue eyes dilate at the promise spoken in foreign words, and Tony throws his suit jacket off before climbing onto the bed and pulling Stephen all the way down onto his back by his thighs. He draws a groan from the younger man when he lifts the leg with drops of chocolate on it, looks down at the sorcerer as he laps up every little bit of the bittersweet delicacy, and then <em>bites down</em> onto pale flesh. Not hard enough to draw blood, but enough that it would leave a bruise and it left Stephen breathless. He always had a weakness for love bites no matter where Tony had left them, and the engineer cherished the real reason Stephen grimaced whenever those marks were left on his thighs. The more perceptive team members automatically assumed the usual reason, but that wasn't always the case.</p><p>Stephen was a tiny bit of a masochist in the bedroom.</p><p>\"How long?\" Tony growls out after dropping Stephen's thigh and sliding a hand up under the silk shirt and across lightly toned abs.<br>\n\"How long what?\" The sorcerer sighs out and trembles in anticipation under his husband's touch.<br>\n\"How long have you been waiting in here for me with nothing but my shirt on?\"<br>\n\"Who ever said I was waiting for you?\" Stephen murmurs casually with an air of provocation.</p><p>Tony chuckles and slides his hand back down to pinch the sorcerer's ass in rebuttal, and then leans down to swallow the sharp gasp he had elicited from the younger man. While Tony busies himself with touching, pinching, and groping every bit of skin he could without taking off the shirt Stephen was wearing, his spouse was fumbling with the buttons on his with magic-steadied hands. The grunts of frustration that came after a good ten seconds of trying were because Stephen couldn't get the damn buttons to cooperate. Not because of his hands. Just when Tony was about to have mercy on his wife, Stephen growls and fists the shirt in both hands.</p><p>\"Take this off!\" He nearly snarls. \"All of it!\"<br>\n\"As you wish, Duchess.\" Tony smirks and removes his shirt, and as he starts on his pants he notices Stephen trying to slip out of his silk shirt. \"Oh no you don't. That stays on.\"</p><p>Stephen stops and looks at him with pupils blown wide, but he nods and pulls Tony back down once the engineer gets the rest of his clothes off. The touching and pinching quickly evolves into kissing, nibbling, and an occasional lick, and leaves Stephen to enjoy the attention as he grips brown hair peppered with gray. It was always nice to take care of Stephen like this. He took it upon himself to take care of the kids, the team, Tony himself, and a million other things...but Tony took care of Stephen in the bedroom. It was rare for the sorcerer to do the work in bed, but he did have his moments...but it was usually like this.</p><p>Scarred fingers in Tony's hair as he nibbles on an exposed collarbone and sucks a hickey onto pale flesh, sliding calloused hands across his body until they end up squeezing the delicious mounds of flesh that was Stephen's ass, and listening to the man moan beautifully under his ministrations. Unfortunately, one hand had to leave the ass to reach blindly to the side for the drawer to the nightstand, and both men groaned when their erections brush against each other. Tony resists the urge to grind back down against Stephen for that much needed friction, instead cursing colorfully on Italian when he can't find the bottle of lube.</p><p>\"<em>Tony…</em>\" Stephen moans quietly, both in reaction to the foreign language and also as a plea to the man.<br>\n\"I know honey. I know. Just…<em>dove cazzo è</em>?!\" Tony curses and then finally feels his fingers brush against the bottle he had been grasping for.</p><p>The engineer pops it open as he pulls the lube out, and slams the drawer shut as he returns his attention to the sorcerer beneath him. After he coats his fingers, he swoops back down to mouth at a nub and uses his free hand to pinch the other. Stephen cries out quietly at the slight stimulation and Tony presses a finger into the sorcerer. His groans grow louder in volume at each finger the engineer adds, and when Tony crooks his fingers and brushes against his prostate, Stephen nearly screams.</p><p>\"Fuck! Yes, right there!\" He begs and arches his back in pleasure.</p><p>Tony pulls back to look down at his writhing spouse and thrusts his fingers in and out, making sure to brush against the sweet spot every time. Seeing Stephen like this, with a sheen of sweat across his brow, Tony's silk shirt open and worn loosely on his shoulders, and with his head thrown back in ecstasy? He could look all day. Tony drank the sight in as long as he possibly could before he was pulling his fingers out and lubing up his own straining cock. There was no inching his way inside. No. Stephen was begging for him the second Tony stepped into their bedroom, so he thrust in to the hilt in one go and Stephen's cry of pleasure was music to his ears.</p><p>\"Please, Tony….<em>please</em>.\" Stephen pleads.<br>\n\"Please what?\" He croons and smiles as the man beneath him mumbles incoherently. \"Use your words <em>tesoro</em>.\"<br>\nBlue eyes sharpen for the briefest second to glare up at him. \"<em>Fuck me!</em>\"</p><p>Stephen's breath hitches when Tony pulls out to the tip before thrusting back into him, and when he starts a harsh but steady pace, the sorcerer brings his head down into a hungry kiss. Teeth clack at the force until a tongue plunges down into the younger's mouth, and Stephen moans into the kiss when Tony throws one of his legs over his shoulder to thrust in deeper. The new angle has Stephen trembling from the overwhelming pleasure and the engineer trails kisses down the younger's jaw and down to his neck where he grazes his teeth against the hickey left there earlier. </p><p>\"Tony... I'm close...so close…\" Stephen warns as he grips his husband's hair again.<br>\n\"<em>Vieni per me.</em>\" Tony growls out and not a moment later, Stephen comes with Tony's name on his lips. </p><p>His orgasm draws out the elder's after a couple of erratic thrusts and Tony pants lightly as he keeps himself from collapsing onto Stephen. His right arm throbs angrily at the pressure he was putting on it, but it was a sacrifice he didn't mind making. Not when he saw the bliss in half-lidded blue eyes when Stephen finally releases his grip on graying hair and Tony looks down at him. This was something only <em>he</em> could give his wife.</p><p>\"Lay down before you make your arm flare up.\" Stephen mumbles after a couple of minutes pass.<br>\nTony chuckles and does as he's told once he pulls out (and Stephen grimaces at the empty feeling and the mess that follows). \"It would have been worth it, knowing I brought you peace of mind. Even if it was for a second.\"<br>\n\"Sometimes you're the reason I need the peace in the first place.\" Stephen gripes half-heartedly but sighs as Tony caresses his cheek and rubs his thumb across the bone there.<br>\n\"At least I can do something about it.\"<br>\n\"You're right. You can stop driving me insane.\"<br>\nTony smirks. \"Then I wouldn't be the man you married.\"<br>\nStephen shuts his eyes. \"...and love.\" He mumbles sleepily.<br>\n\"Taking twenty?\" Tony asks gently and Stephen hums in acknowledgement. \"Sounds like a plan. We'll clean up afterwards.\"</p><p>He curls an arm around Stephen and pulls him close after he partially wipes the younger down with a sheet, and kisses his forehead.</p><p>\"I love you too, Duchess.\" Tony whispers and then follows the sorcerer's example.</p><p>The exhaustion was catching up with him again after all.</p></div>"}
{"work_id": "23787067", "text": "<div class=\"userstuff\"><p>“He is right, you know,” Touya said through a mouthful of too-hot curry. “Most of us should be locked up.”</p><p>Keigo's tv was huge, taking most of the wall, and the shaky footage of the Hero killer Stain being detained was making Touya nauseous, so he fixed his eyes in his take-out container. It was only a matter of time until they moved on from the villain to the hero who had defeated him, and he wanted to eat his fill before seeing his father being praised. That always killed his apettite.</p><p>“What, you don't wanna be a hero anymore?” Keigo asked slowly. He was shirtless, sitting cross legged on the floor, ripping pieces of chicken karaage with his sharp, talon-like fingers. Although Touya couldn't see his face, he knew that measured tone Keigo adopted when he was ready for an argument.</p><p>“Stop twisting my words like that,” he huffed. “I'm just saying, he has a point. Some heroes are rotten.”</p><p>“Not all of them are bad, though.”</p><p>“Yeah, yeah, don't not-all-heroes me. I know. I didn't mean <em>us</em>.”</p><p>With a long suffering sigh Keigo rested his head onto Touya's thigh, twisting his neck to look at him with those huge amber eyes. “Sorry I got defensive. I just never know what you want me to say when it comes to your dad.”</p><p>Touya slid from the couch to the floor to sit next to him, knees brushing, and slipped a hand between Keigo's wings. He all but purred when Touya started scratching him there, in his favorite spot, right where the feathers started.</p><p>“We weren't talking about my dad.”</p><p>A half sile formed in Keigo's lips. “We kinda were.”</p><p>“...I guess. Just tell me he is a bastard.”</p><p>“He is a bastard,” Keigo agreed. The tv was now showing the panicked crowds at Hosu city and the equally panicked heroes trying to calm them down.</p><p>“A shame Stain didn't get Endeavor before being arrested,” Touya said distractedly and stole a piece of chicken from Keigo's plate. Immediately the wings snapped open, slapping onto Touya's shoulder and almost knocking him down.</p><p>“Auch! What was that for?”</p><p>“Animal instinct,” Keigo replied smugly and stole back the chicken Touya had taken.</p><p>“Oh yeah? Well, I have arsonist instinct,” he said and with just a thought he called the fire to his hand. Not too hot, just a fistful of red fire, but enough that Keigo could feel its warmth. “Careful, pretty bird. You can grow new feathers but I can't grow a new arm.”</p><p>Instead of putting distance between them, Keigo scooted closer, his naked chest pressing against Touya's arms, and then blew on the fire like a kid blowing his birthday candles. Touya extinguised it, just to humour him. He would have done anything for that smile, the one that said “I know you did that for me, although I'm a pain in your ass, and I love you for it”. Even if Keigo would never admit being a pain in the ass.</p><p>“You are getting better. You could try that flying thing again next time we train,” Keigo said with a tiny kiss to the corner of his mouth. But Touya was ignoring him, focused instead in the tv.</p><p>\"Was that...?”</p><p>\"What?\" Keigo said, untroubled, and dig into another piece of chicken.</p><p>Touya leaned in to have a closer look. The images were showing the entry to the alley where the fight had taken place.</p><p>\"I think I just saw...\"</p><p>Once he was paying attention it was easy to spot him, with half of his hair as white as their mom's, and half the same fiery red than Touya himself.</p><p>Touya stood so fast he knocked over the take out containers, spilling curry all over the floor.</p><p>\"Fuck,\" Keigo breathed. \"Let me get my coat.\"</p><p align=\"center\">***</p><p>&nbsp;</p><p>In his panic, Touya slammed the door open.</p><p>“Shouto!”</p><p>“I'm okay,” his brother said.</p><p>“He's been stabbed,” the doctor informed.</p><p>Touya hurried to his side and grabbed Shouto by the shoulders, careful not to touch any bandages or bruises. His little brother was sitting in bed, rolling his eyes, mildly bothered by all the fuss. But he wasn't pushing him away, so Touya took a few extra seconds to reassure himself he was fine.</p><p>“I said I'm okay, Touya. It was a stupid accident.”</p><p>“You got accidentaly stabbed by a villain?” Hawks asked. He had walked in right after him, all ruffled hair and ruffled feathers, and was ignoring the doctor's complaints. “Classic Todoroki behaviour. He takes after you, Soen.”</p><p>“Soen? That's Soen!” the plain-looking kid in the next bed whispered. “His quirk has incredible destructive power, blue fire even hotter than Endeavor's Hellflame!”</p><p>Shouto pointed at him with a thumb like he did that every week. “Midoriya, from my class. And Iida, our class rep. This is mi oldest brother, Touya.”</p><p>It was an effort to look away from his little brother's face. That Midoriya kid looked familiar, and he recognised Iida as once. He and Hawks had met Ingenium a few times, before the attack, and this boy looked like a younger clone.</p><p>“Sorry about your brother, Iida. I hope he makes a full recovery.” The kid nodded seriously. He seemed like the type to take responsability for everything. “And Midoriya... yeah, I saw your fights during the sports festival. You were good.”</p><p>“T-thank you!” he stammered. Both boys bowed their heads. Nice kids.</p><p>“The kid who convinced little Shouto to use his fire, huh?” Hawks said. “Good job.”</p><p>“Keigo, shut the fuck up.”</p><p>Midoriya didn't seem to hear them. “Hawks! The fastest hero ever!” he gushed like Keigo wasn't right there. “He was number three in the last billboard chart... he can control every feather individually...” His words became a fevered muttering and Keigo turned to look at Touya with wide eyes and mouthed <em>what the fuck</em> with a huge smile. He loved being a hero, but lived for the praise.</p><p>“He is obssessed with pro heroes.\" Shouto explained. \"But why did you even bring him here?” He had been openly hostile towards Hawks for as long as they had known each other, like he blamed him for stealing his brother away.</p><p>“I gave him a ride,” Hawks said smugly before Touya could answer.</p><p>“I really don't wanna know the details,” Shouto bit back. He never missed any double meanings, even if he enjoyed playing dumb.</p><p>Touya snapped his fingers in front of his face to break the staring contest that was about to happen. “Hey. Behave.” Shouto just glared at him and said nothing. Sometimes Touya didn't know what gave him chills: his brother's eyes, serious beyond his years, or that scar. “That goes for you too, Keigo.”</p><p>The doctor cleared her throat.</p><p>\"He needs lots of rest to recover from their injuries, but can do so at home if you wanna take him now.\"</p><p>Ah. Shouto and Touya shared a knowing glance.</p><p>The few times they had been in the hospital when they were little, no one ever asked how they got hurt. Kids just get rowdy, their quirk is too powerful and they can't control it yet, they knew every excuse. No doctor had ever asked if they felt safe going home. The fact that the number one hero was hurting his children didn't even cross their minds.</p><p>\"Sleeping here is fine. I don't want to inconvenience Fuyumi,\" Shouto said when his brother hesitated.</p><p>Touya shook his head. Even now, he knew Shouto hated going back home.</p><p>\"You can stay at my flat if you need to. As long as you want.\"</p><p>Keigo pouted.&nbsp;They weren't living together, technically, but Touya spent most of the time in his apartment. Going back to his own flat to look after his little brother meant much less attention for him.</p><p>\"Thank you, but I would rather stay with my friends tonight.\"</p><p>It stung. Touya couldn't keep the wince away from his face. He had lost Shouto's trust little by little, his inability to protect him from their father chipping away at their relationship until he barely knew his little brother. Touya had been too self-centered in his hate, training himself to the bone to control his quirk, get into UA and prove Endeavor he could be a hero. And meanwhile his brother, only five years old at the time, took the brunt of the abuse. Only when Touya turned eighteen and left the house for good had he confronted Endeavor and made it perfectly clear that he would destroy his career if he ever even looked in Shouto's direction again.</p><p>Too little, too late.</p><p>Forcing a tense smile, Touya brushed the hair away from Shouto's face. That kid was in perpetual need of a haircut.</p><p>\"Sure. Have some rest.\"</p><p>\"Let us know if you need a flight home tomorrow,\" Keigo said and winked.</p><p>Touya thanked the doctor and said goodbye to the kids, still heroes in training who shouldn't have been fighting villains.</p><p>The knot in his stomach didn't ease on their way home.</p><p align=\"center\">&nbsp;</p><p align=\"center\">***</p><p>&nbsp;</p><p>Keigo always slept in fits and starts, a sequel of his harsh training. Touya had been the same, at first, coming from an abusive household, but he had gotten better.</p><p>Keigo hadn't.</p><p>But that night when he opened his eyes at three in the morning, startled by some noise or the lack of, Touya wasn't in bed.</p><p>Still half asleep Keigo sent a bunch of feathers out, which promptly informed him Touya was in the living room, awake and threatening him with fire.</p><p>\"Stop telling my feathers you are gonna burn them. They have feelings, you know,\" he complained as he made his way out of the bedroom. The feathers had launched an attack on Touya, dipping and feinting and circling his head, trying to tickle him. They only stopped when Keigo nestled next to him with a yawn. The light in the room shifted and flickered as the scenes on tv changed and Touya practiced his quirck lighting and extinguishing candles with a flick of his fingers.</p><p>“Alright, spit it. What has you so upset? The noise of your angst is keeping me awake.”</p><p>\"You were snoring for two hours,\" Touya argued.</p><p>\"Well, I'm awake now. Tell me.\" Keigo called a long feather to his hand and dragged its tip along Touya's arm, where the skin was red and uneven from being burnt and healed over and over.</p><p>Touya glared at him.</p><p>\"I will incinerate you, Hawks.\"</p><p>Keigo waited. Sometimes, it was the only thing he could do when it came to Touya.</p><p>And sure enough, after a minute he sighed and put an arm around his shoulders.</p><p>“Shouto was attacked by a villain.”</p><p>\"Yeah, I noticed,\" Keigo muttered. Touya's deep voice sent a pleasant rumble through his body, but his next words woke him suddenly.</p><p>“My baby brother got attacked by a fucking villain. And I was saying he was right, Keigo. I agreed that maybe heroes deserved what was coming for them.\"</p><p>Keigo flinched. \"You couldn't know...\"</p><p>\"I saw him on tv, that murderer who put Shouto in the hospital, and I said that he had a fucking point.”&nbsp;Touya's eyes were wet and angry under the light of the candles.&nbsp; “I didn't protect him from Endeavor. And now I can't protect him from villains.”</p><p>“Shouto will be just fine.”</p><p>“Fine? While working for <em>him</em> because I can't teach him enough about our quirk?” A hysterical laugh bubbled up in Touya's chest. “I should have been a villain.”</p><p>“Hey, don't joke about that.” Keigo grabbed his face with both hands to force Touya to look at him. His aqua eyes seemed to reflect the light, like a cat.</p><p>“Who's joking?\" Touya said bitterly. \"I was a useless older brother to my siblings, a useless oldest child to my mom. Useless as a student, useless as a hero.”</p><p>\"You did your best! You save people!\"</p><p>“<em>You</em> save people. I make walls of fire.”</p><p>Keigo couldn't argue with that. The blue flames were impressive but difficult to control, too destructive. Good for fighting powerful villains, which made Soen a popular pro hero, but not a match for the precise work he could do with his feathers and his speed.</p><p>\"Still, you couldn't be a villain. Because where would that leave me? I need you.\" Desperate to get to him, Keigo climbed on his lap and straddled him, pinning Touya against the couch. \"I wouldn't have survived it. I would have drunk myself to death by now because I would be so fucking lonely without you. You can't be a villain, because then I would be a villain.\"</p><p>Finally, like he was waking from a bad dream, Touya's eyes focused on him and smiled. A cold smile, a ruthless smile, born of spite and scars, but still a smile.</p><p>“Obviously I can't. I won't. But what if I had?” He rubbed his hands absent mindedly along Keigo's thighs. His skin was too hot to the touch, like he was running a fever. “Sometimes I fantasize about it. If I were a villain, I could take out Endeavor, I know I could. My fire is stronger than his.”</p><p>“No. Even if you threw your whole life away for revenge, even if you could stand using your own quirk at full power, you couldn't kill him. His skills are...” Keigo shook his head, impressed against his own will. “Like that flying thing. Endeavour would only need to grab you and drop you from someplace high.”</p><p>Touya buried his face in Keigo's neck and whispered against his skin:</p><p>“I would have you to catch me.”</p><p>“Nah. If you were a villain, I wouldn't.”</p><p>Touya gasped in mocking indignation and straightened up. Just imagining killing his father had improved his mood, as dark as that sounded.</p><p>“You wouldn't love me if I were a villain?” Touya's eyes were smiling when he leaned in to kiss him.</p><p>“No,” Keigo lied.</p><p>“Liar.”</p><p>\"Maybe. We'll never know, because you are no villain, Todoroki Touya,\" Keigo said, and he finally melted into the kiss, knowing that deep down, they both knew.</p><p>He would love him, hero or villain, no matter what.</p></div>"}
{"work_id": "23816656", "text": "<div class=\"userstuff\"><p>This cup of tea was perfect.&nbsp; It was just right.&nbsp; Ellie was quite proud of herself for managing it, and she was quite certain she would never manage it again, so she was determined to enjoy this.&nbsp; It was her first night off in weeks, and she was staying in.&nbsp; The boys were with friends and she had the house all to herself, just to breathe and watch the telly, and <em>enjoy this cup of tea</em>.&nbsp; Everything was all set.&nbsp; This was a great start to a good evening.</p><p>That is, until she heard a knocking at the door.</p><p>“Oh,” she sighed, setting her mug down on the counter.</p><p>They knocked again.</p><p>“Yes, I’m coming!” she called, but they knocked yet again.&nbsp; “Alright,” she said as she opened the door.</p><p>Just as she reached for the lock, she had the thought that maybe she should have had a weapon.&nbsp; Just in case.&nbsp; But standing there in the door wasn’t an attacker or a robber.&nbsp; It was Hardy.&nbsp; He looked…strange.&nbsp; She couldn’t put her finger on it.&nbsp; Some mad combination of sad and desperate, and maybe something else.</p><p>“What are you—”</p><p>“Miller, I wanted to talk,” he said.&nbsp; His voice was even but tinted with some kind of motive or desire.</p><p>Bugger, she needed to stop trying to read into this.</p><p>“Phones exist, you know,” she said, smiling to try to lighten the mood, and he nodded, just as stoic as ever.&nbsp; “Is everything alright?”</p><p>“This afternoon you asked me down to the pub,” he said.</p><p>“I did,” she said.</p><p>“I’m sorry, I wasn’t sure…”</p><p>“It’s alright,” she said.</p><p>“I realize now you were probably trying to…God, I’m an idiot,” he said, shaking his head.</p><p>She swallowed, hoping that would also push down her impulse to laugh or agree with him.&nbsp; She didn’t genuinely believe it, but habits are habits.</p><p>“I’d love to…go for a drink sometime,” he said.&nbsp; “Or dinner.&nbsp; Or whatever.&nbsp; If you still want to.”</p><p>Her eyes widened.&nbsp; “Oh.”</p><p>“I’m sorry.&nbsp; I probably look mad turning up here like this.&nbsp; I should go.”&nbsp; He turned to leave.</p><p>“Wait,” she said, and he turned to face her again, that same look in his eyes.</p><p>Dammit, she wished he’d stop with whatever these looks were that he’d been giving her the past few weeks.</p><p>“Hardy, I,” she said, then stopped herself.&nbsp; “Alec.&nbsp; Is that okay?&nbsp; Alec?&nbsp; Can I call you that?&nbsp; I know you said you don’t like it.”</p><p>“That was because…”&nbsp; He shook his head.&nbsp; “No.&nbsp; You can call me that,” he said.</p><p>“Thanks,” she said, looking over her shoulder.&nbsp; “Alec, I would like to talk.&nbsp; Do you want to come in?”</p><p>He gave a little half nod and she stepped back so he could come in, and she shut the door behind them.&nbsp; The entryway was dark and they stood there in the narrow little passage into the house for a moment, face to face, before she started to move further into the house.&nbsp; He got the idea at the same time, and almost bumped into her but waited, letting her go first, and they laughed a little, no less nervous.</p><p>She led him into the kitchen, and she passed him her cup of tea, then went to work making another.&nbsp; It wouldn’t be as good, but in all honesty, right now she’d hardly know the difference.</p><p>“You were trying to ask me out today, weren’t you?&nbsp; I’ve not imagined that myself?” he said quietly.</p><p>“I don’t know what I was trying to do,” she said.&nbsp; “I suppose that was my intention.&nbsp; I thought…”</p><p>She went to the sink and rinsed her hands, then crossed in front of him again to dry them on a tea towel which was hanging through a drawer handle.&nbsp; She laughed.&nbsp; Not an amused laugh, not a funny laugh.&nbsp; It was nervous.&nbsp; It was scared.&nbsp; He looked at her carefully.</p><p>“In our position I’m not supposed to do that,” she said after a moment.&nbsp; “I know that.&nbsp; Could get me fired, or worse.&nbsp; But er…yeah.&nbsp; That is what I was trying to do.”</p><p>“I wouldn’t get you fired,” he murmured, taking a sip from his mug.</p><p>“I thought that maybe because everyone was going, if I asked you to join it’d be a little less obvious,” she said.&nbsp; “When you said no, I was a bit disappointed, but I guess I was also…relieved?”</p><p>He nodded.&nbsp; “I get that.&nbsp; I’ve been thinking of the same thing for a while, though, if that makes you feel any better.”</p><p>Her heart felt like it sank.&nbsp; It was supposed to skip a beat.&nbsp; That’s what she’d always heard.&nbsp; When something like this happens, your heart is supposed to skip a beat.&nbsp; But just now, it sank.&nbsp; Then immediately picked up, seemingly twice as fast.&nbsp; She cleared her throat.</p><p>The kettle whistled and she reached for that, pouring the water over into a second mug, and got the box of tea back down from the cabinet, putting her back to him.</p><p>“I guess I was scared, too,” he continued.&nbsp; “Especially with everything going on.”</p><p>“Right,” she said.&nbsp; “Thinking back, though,” she smiled, “you were quite obvious with the whole kissing thing.”</p><p>His brow furrowed.&nbsp; “What?”</p><p>“‘Miller, I could kiss you,’” she said, turning back around, a smile on her face.</p><p>“Oh, that,” he said, and took another long sip.&nbsp; “Yeah, that was a bit of a slip,” he sighed.</p><p>She laughed, and so did he, both a bit more comfortable now.</p><p>“So, how long?” she asked.</p><p>“Hm?” he intoned.</p><p>“How long have you been thinking about this?”</p><p>There was a long pause, and he shook his head, looking down into his cup.</p><p>“I hate to say it,” he said.</p><p>“I’ll tell you mine if you tell me yours.”</p><p>She laughed quietly, just once, and the corner of his mouth quirked up in a small, crooked sort of smile.</p><p>“I realized it when you asked if I’d had sex with Claire Ripley,” he muttered into his cup as he raised it again.</p><p>“What?” she laughed.</p><p>“I’m not sure how long before that,” he confessed.&nbsp; “I just know I realized it then because I was ashamed that you knew.&nbsp; I was ashamed that it happened, but I was even more ashamed that you knew.&nbsp; It was different because you knew.&nbsp; I didn’t like that.”</p><p>“Oh,” she said again, holding the string of her teabag and bobbing it in the steaming cup, watching as the color spread, became more evenly dark.</p><p>He cleared his throat, looking down at his hands on the mug.&nbsp; They were shaking.</p><p>“You know, I realized that time when we were walking,” she said.</p><p>“You’ve got to be clearer than that, Miller,” he laughed, then immediately sobered, realizing what he’d called her.&nbsp; “Ellie, I mean.&nbsp; First names now and all.”</p><p>“Not if you don’t want to,” she said quietly.</p><p>“I want to.”</p><p>“Okay,” she said, smiling.&nbsp; “Er, well, I mean, with Fred at the fair.&nbsp; I think that’s when I really knew.”</p><p>He looked at her, eyes wide but his expression otherwise blank.</p><p>“That’s—that’s just when I realized,” she said.&nbsp; “I’m sure it was much sooner that it actually started.&nbsp; You know.&nbsp; So don’t feel weird or anything.”</p><p>“No,” he said, shooting for casual and winding up somewhere between embarrassed and uneasy.</p><p>“You know,” she said, relaxing a bit and gaining a sort of dreamy, thoughtful look in her eyes, “it was probably around the time of Joe’s trial.&nbsp; When people started asking if we’d…well, you know.”&nbsp; She took the teabag out of her cup and deposited it into the sink, then went to the fridge to get the milk.&nbsp; “A little while after that, I started thinking about it.”</p><p>He coughed, choking on a mouthful of tea.</p><p>“Shit, sorry,” she said.&nbsp; “Not that.”&nbsp; She laughed a little as she patted him on the back, and once he’d calmed down some, went back to her tea.&nbsp; “Just, you know, you.&nbsp; Whether or not I liked you that way, or if it would even work.&nbsp; A relationship, I mean.&nbsp; Real or made up.”</p><p>He nodded, thinking.&nbsp; He’d never expected this much of a discussion.&nbsp; In truth, he’d expected Miller to slam the door in his face for turning up at her house so late or for being so rude to her that afternoon, or if she did talk to him, just some polite laughter and a plan to go out to dinner on Sunday.&nbsp; He never thought she’d invite him in, give him her tea, and reminisce with him when they’d realized they had feelings for one another.</p><p>“To tell the truth, I never imagined we’d be talking about this,” she said, and his eyes widened but he said nothing.&nbsp; “I assumed it was just some…some work crush, and it would be over.&nbsp; But I’ve grown quite fond of you, you old wanker.”</p><p>“Thanks,” he said, going to take another sip from his mug and instead lowering it awkwardly after realizing it was already empty.</p><p><em>Nervous drinker, you are</em>, he thought to himself, and snickered.</p><p>“What’s so funny?” she asked.</p><p>“This is a bit weird from me,” he said.&nbsp; “It’s just…I haven’t had this sort of conversation in years.&nbsp; I haven’t,” he cut himself off and shook his head.&nbsp; “Well, I haven’t had this sort of conversation since my wife.&nbsp; And that was about twenty years ago.”</p><p>“I thought you’d been on dates since,” she said.</p><p>“Just one,” he said.&nbsp; “And it never got serious.”</p><p>“What about Claire?”</p><p>“Sex isn’t love, Miller,” he said.</p><p>Her smile faded, her expression falling from teasing to serious.</p><p>“Love?” she said, her voice barely a whisper.&nbsp; “Is…that how you feel?”</p><p>His eyes widened.&nbsp; Maybe that was too a strong word to use just yet.&nbsp; “I’m sorry.&nbsp; I sh—”</p><p>“No,” she said, shaking her head.&nbsp; She took a sip from her cup, smiling again.&nbsp; “Love.&nbsp; I like that.”</p><p>“Okay.”</p><p>She cleared her throat.&nbsp; “To tell you the truth, I haven’t had this conversation in probably about twenty years as well.&nbsp; My marriage with Joe was the only serious relationship I had and you’re the first person I’ve felt this way for since.”</p><p>“So where do we start?&nbsp; What are we supposed to do about this?” he asked.</p><p>He set his mug down and leaned on the counter as he looked at her.&nbsp; His expression had softened.&nbsp; But not only that.&nbsp; His whole demeanor seemed to have softened.&nbsp; Ellie smiled.&nbsp; Alec Hardy, gone soft over his detective sergeant.&nbsp; What talk that’ll be.&nbsp; And for her to have fallen for him, too.&nbsp; Even better.</p><p>“I don’t know,” she said.&nbsp; “What do you want to do?”</p><p>He inhaled deeply and then exhaled, letting the air out slowly.&nbsp; He looked somewhat past her at a spot on the floor.</p><p>“We’ve never been to the pub, like you said,” he said after a moment.&nbsp; “We could still do that, if you like.”</p><p>“No,” she said, imitating the tone of voice he’d used with her that afternoon.</p><p>“Oh,” he said.</p><p>He looked down again, disappointed.</p><p>“No, because I think I’d rather have dinner than a drink,” she said.</p><p>“Oh,” he said again, a bit more optimistic now.&nbsp; “Alright.”</p><p>“Nowhere too fancy if you don’t like,” she said.&nbsp; “Just a chippie or maybe we can splurge for a pizza and beer.&nbsp; Hang out at one of our places, have a chat.”</p><p>“We’ve done that loads of times,” he said.</p><p>“This time’ll be different,” she said.&nbsp; “This time it won’t be because of work or because you’re sick or because I need somebody around.&nbsp; It’ll be because we’re spending time together and getting to know each other aside from work and kids.”</p><p>“Alright.&nbsp; I’d like that,” he said.&nbsp; “When?”</p><p>“Sunday evening good for you?”</p><p>“Sunday evening’s fine,” he said with a smile, one that really suited him, that looked real.&nbsp; Ellie couldn’t help but smile back.&nbsp; “And, er,” he hesitated, “your place or mine?”</p><p>“Where are you most comfortable?” she asked.</p><p>“Well this weekend Daisy’s going with Chloe Latimer to look at a school,” he said.&nbsp; “So mine’ll be empty.”</p><p>“Yours it is then,” she said.</p><p>There was a brief silence, filled only by the sound of the clock ticking in the entryway.&nbsp; Alec cleared his throat and stood up a bit straighter.</p><p>“I should get back,” he said.&nbsp; “Let you get on with your evening.”&nbsp; He headed toward the door tentatively, as though he half-expected her to stop him or say something.&nbsp; “Thanks for the tea, and er, I’m sorry for coming over unannounced like this.”</p><p>“It’s no problem.”&nbsp; She chuckled.&nbsp; “I’m really very glad you did.”</p><p>“Good,” he muttered.&nbsp; “Me, too.”</p><p>“Let me walk you to the door.”</p><p>She led him back through the house to the front door, and she opened it again, this time to let him out.&nbsp; On the doorstep, he turned around to face her again where she stood on the other side of the threshold.</p><p>“I’ll see you at work then,” he said.</p><p>“See you at work.”</p><p>He started to leave, but before he had fully turned away she stopped him, and she pulled him down into a kiss, short and sweet.&nbsp; Then there was another, from him this time, and another, which gradually turned into another, more urgent kiss, a deeper, hungrier kiss.&nbsp; She leaned against the wall just outside the door and he pressed his body against hers.&nbsp; He wasn’t entirely sure what he was doing, or what he was even <em>supposed</em> to be doing.&nbsp; It had been quite a while since he’d kissed anyone like this, but he felt he was quickly getting the hang of it again.</p><p>It was just so strange to be doing this here, with Miller, er, <em>Ellie</em>.&nbsp; He had to get used to that.&nbsp;And it certainly wasn’t how he imagined it.  He felt like he was in school again, sneaking around with a girlfriend, getting one last good kiss good night before her father came downstairs and saw what they were doing.&nbsp; Not that he really had any experience with that sort of thing, because <em>he didn’t</em>, he reminded himself.</p><p>“It would be really inappropriate if I asked you back inside, wouldn’t it?” she said breathlessly once he pulled away.</p><p>“I…er, probably,” he said, and he closed his eyes tight shut, trying to reorient himself.</p><p>He laughed, and so did she.</p><p>“I’ll see you at work, then,” she said.</p><p>“See you at work,” he said.</p><p>“Good night.”</p><p>“Good night,” he said, backing away slowly and heading down the drive.</p><p>Once he was out of sight, Ellie stepped back inside, pulling the sleeves down on her jumper, over her hand, and smiling to herself as she closed the door.</p></div>"}
{"work_id": "23802586", "text": "<div class=\"userstuff\"><p>&nbsp;</p><p>“Wanning,” Mo Ran says, taking a sip of his wine before setting it down again. “You stopped eating.”</p><p>And fuck, the look Wanning shoots him is so hot Mo Ran just wants to bend him over the table and fuck him right now in front of everyone.</p><p>“Mo Ran...” Wanning says under his breath, a threat mixed with a plea, and Mo Ran just smiles at him.</p><p>“Keep eating, Wanning,” he says, then lifts an eyebrow until Wanning lets out a deep breath and picks his fork up with a shaky hand, stabbing a piece of steak with it and shoving it in his mouth.</p><p>“Mmm good, now chew,” Mo Ran says, laughing softly when Wanning shoots him a death glare. “That’s hot, baby. Keep glaring at me like that and I’ll give you something even better to put in your mouth.”</p><p>“Fuck off,” Wanning mutters under his breath and Mo Ran just grins, waiting patiently for Wanning to swallow his food before he swipes his finger across his screen and watches Wanning bring his hand to his face, mouth falling open behind it. “S-<em>stop</em>.”</p><p>Mo Ran starts to tell him he’ll stop when <em>he</em> feels like it, but he can see the waiter approaching over Wanning’s shoulder and decides to take pity on him, turning it down to the lowest setting while the waiter comes up and pours Wanning more water and takes their plates.</p><p>“Dessert?” He asks and Mo Ran nods and picks up the dessert menu, taking his time looking over the choices as Wanning concentrates deeply on one of the paintings hung on the wall above them.</p><p>“The tiramisu, I think,” Mo Ran finally says, ordering one plate and two spoons, and as soon as the waiter walks away he unlocks his phone and changes the setting on the vibrator to pulse.</p><p>Wanning’s hand jerks suddenly on the table and his eyes fly to Mo Ran’s at the first strong pulse, then his face relaxes when it stops and Mo Ran almost laughs, because Wanning has <em>no idea. </em>The second pulse comes a few seconds later and this time Wanning’s glare is shocked and murderous. The third pulse comes sooner, lasts longer, and Wanning’s teeth dig into his bottom lip as Mo Ran hears the slightest, softest whimper come out of him.</p><p>“Watch it, now,” he murmurs. “You don’t want people to hear, do you?”</p><p>Then he changes the setting again, still pulses, but closer together, with one long, strong vibration at the end. After just the first sequence Wanning’s nails are digging into his palms and there’s sweat beading on his temples and Mo Ran can tell he’s struggling to stay quiet.</p><p>“Or maybe that is what you want,” Mo Ran leans closer so that he can lower his voice. “Maybe you want everyone to hear what a slut you are for me.”</p><p>Wanning closes his eyes and drops his head, running one of his hands through his hair as the other one stays clenched into a fist atop the table.</p><p>“Mo Ran, please,” he pleads under his breath. “I can’t. No more.”</p><p>Mo Ran has a moment where he thinks he should probably have mercy on him. Wanning has done way better than he’d expected, way better than Mo Ran himself ever would’ve been able to handle, but then the waiter is coming back with their dessert and Wanning is nearly panting and that Thing happens in Mo Ran’s brain — the thing that always gets him into trouble, and right before the waiter reaches their table he turns the vibrator all the way up and flips his phone over.</p><p>He hears the barely audible gasp leave Wanning’s lips just as the waiter sidles up to their table and sets the plate down between them, taking his time setting a spoon in front of Wanning and one in front of Mo Ran. Or at least it seems like he takes his sweet time. It’s probably only moments before he’s asking Mo Ran if he needs anything else and walking away, but knowing that Wanning is sitting across from him with a fat plug in his ass that’s vibrating at the highest setting and driving him out of his mind tends to make Mo Ran a little impatient.</p><p>As soon as the waiter is gone Wanning slams his hand down on the table and levels a glare at Mo Ran, the edges of his hairline now damp with sweat and grits out,<em> turn it off. </em></p><p>Mo Ran does not turn it off, but he does turn it all the way down to give him a break.</p><p>“Oh, Wanning that was fucking beautiful,” he purrs. “Did you like that? Having that cute little waiter sitting your tiramisu in front of you with my plug in your ass? How bad do you wanna come right now, huh?”</p><p>“Mo <em>Ran</em>,” Wanning hisses, looking around them, and Mo Ran just chuckles. It’s late and there’s hardly anyone around them, Mo Ran had specifically asked for a secluded section, so Wanning really doesn’t have to worry about anyone hearing him. But Mo Ran likes that he <em>is</em>.</p><p>“Here, you earned a little treat for doing so well tonight,” he says, getting some tiramisu on his spoon and holding it out for Wanning to take a bite.</p><p>Wanning just glares at it.</p><p>“Come on,” Mo Ran grins. “I know how much you want it, Wanning. You love tiramisu. It’s one of your favorites.”</p><p>It is and Mo Ran kind of hates that he knows that, along with what Wanning’s favorite cereal and teas are and which brand of laundry detergent he’s allergic to. It’s wild. He never thought he’d ever get close enough to someone to know those kinds of things about him. He never thought he’d care enough to.</p><p>“Wanning,” he frowns when Wanning purses his lips together and still refuses to take the bite from him. “You’ve been so good for me tonight, baby. You can do this one little thing for me.”</p><p>Wanning’s eyes glaze over a little and Mo Ran watches, his cock twitching a little in his slacks as Wanning wets his lips and parts his mouth, then leans in to take the tiramisu off the spoon.</p><p>“Fuck,” Mo Ran breathes out, bringing the spoon to his own mouth and licking away what Wanning missed. “Ah. Yeah, that was real good.”</p><p>Wanning sits there patiently and lets Mo Ran feed him the rest of it, taking a bite for himself in between feeding Wanning bites, and by the time he’s finished Mo Ran is half hard. Fuck, he loves Wanning like this. Eyes glazed over and unfocused, almost loose and pliant. It's like he’s been fucked out without even being fucked.</p><p>Mo Ran gives the waiter his card when he comes back around with the check, ready to get out of there and get Wanning home so he can fuck the <em>life</em> out of him, but it ends up taking forever and unlike Wanning, Mo Ran is not known for his patience. So, while they wait, Mo Ran reaches for his phone again. He sees Wanning jerk to attention as soon as he sees him grab it, hears the <em>no please</em>, leave Wanning’s lips right before Mo Ran raises the intensity again. He drags the slider up to about the middle, then sets his phone down and picks his glass of wine up, swirling it around as he watches Wanning squirm and blush across from him.</p><p>God, it’s fucking beautiful. Wanning’s hair is sticking up in places from where he had his hand in it earlier and his cheeks and the tips</p><p>of his ears are pink, his mouth bitten and abused and Mo Ran really, really needs to get him out of here before he does something to get them both arrested.</p><p>“How do you feel?” He asks and when Wanning lifts his eyes to look at him it’s like a punch to the gut. <em>God</em>, he looks completely wrecked.</p><p>“Mo Ran, I...”</p><p>“How does it <em>feel</em>,” Mo Ran asks again, keeping him on track, and Wanning blinks at him like he’d already forgotten the question.</p><p>“Too much,” he murmurs, wetting his lips and swallowing, eyes rolling back in his head. “It’s too much.”</p><p>“God, Wanning,” Mo Ran murmurs. “You’re so fucking pretty like this. How close are you?”</p><p>“Hnn,” Wanning says, bringing his hand up to cover his face again, fingers splayed out over his mouth as he gasps and squirms in his seat. “Mo Ran, <em>please</em>...”</p><p>Mo Ran drags the slider up higher. “How close?”</p><p>“<em>Close</em>,” Wanning gasps sharply, running his fingers though his hair roughly again, tugging at it as he bites his mouth. He looks like he’s completely forgotten where they are now, like he’s about three seconds from tipping his head back and moaning. It’s hot as fuck.</p><p>“Yeah?” Mo Ran asks, licking his own lips as he watches Wanning’s eyes roll back again. “You gonna come for me, Wanning? Right here in the restaurant? Mm, yeah, I think I want that.”</p><p>Then he’s dragging the slider all the way up and raising his foot under the table to press it between Wanning’s legs and Wanning jerks and quickly covers his face with both hands, whimpering a little too loudly into them as his shoulders and arms shakes with what Mo Ran absolutely knows is from him coming in his pants.</p><p>“Holy shit, baby,” he murmurs, turning the vibrator off. “Fuck, if he doesn’t get back here with my card soon we’re leaving without it holy <em>shit</em> I need to be in you, like right now.”</p><p>Wanning whimpers again, body shuddering through the aftershocks, and when he takes his hands away from his face and looks at Mo Ran there are tear stains on his cheeks and Mo Ran wants him so badly it’s terrifying. He wants to fuck him, to ruin him, but he wants so much more than that too. He wants to take Wanning home and put him in the bath and soap him up while he tells him how fucking good he was and how happy he made him. He wants to wrap him in a soft robe after and carry him to bed after and curl around him and know that no one else will ever fit against him so perfectly.</p><p>“Fucking perfect,” is all he says as he reaches across the table for Wanning’s hand, and hopes that gets his point across well enough.</p></div>"}
{"work_id": "23817100", "text": "<div class=\"userstuff\"><p>\n  <span>Sokka wasn’t really a poetic guy, which is why it didn’t really make sense for him, hours after everyone left him alone with his thoughts at the spirit oasis, he was asking himself questions like, </span>\n  <em>\n    <span>Why is it darker now than it was without the moon?</span>\n  </em>\n  <span> and </span>\n  <em>\n    <span>If love is so beautiful, how can it hurt so bad?</span>\n  </em>\n</p><p>\n  <span>It wasn’t very becoming of a warrior, and, worse, none of it came close to expressing the raw, tearing pain that had been throbbing in his chest even before Yue disappeared from his arms, knowing both that he’s failed her and her father and, if she was right, that it was always their destiny for him to do so.</span>\n</p><p>\n  <span>It wasn’t </span>\n  <em>\n    <span>fair.</span>\n  </em>\n  <span> They’re on this mission to save the world from the Fire Nation or whatever, and today they won, even though it took Aang turning into a giant koi or whatever, and they still couldn’t save Yue.</span>\n</p><p>\n  <span>Sokka dug the heel of his palms into his eyes, like he could force the tears back in, except when he lowered his hands again, there’s a white haze hanging in his vision, so he rubbed at them again, and then a third time before jumping up.</span>\n</p><p>\n  <em>\n    <span>Yue.</span>\n  </em>\n  <span> She looked different different now; Sokka would have always said she looked like a goddess, a moonbeam on walking among the rest of them, but looking at her as she hovered above the oasis—she was beautiful then, but if there had been just a piece of something eternal in her before, she embodied it now, glowing as her hair and her dress flowed around her.</span>\n</p><p>\n  <span>“I am so glad you stayed, Sokka,” Yue said, before drifting down and pressing her lips to his. Never in a million years would Sokka have guessed that his first real kiss would be with the moon spirit, and he never would have guessed that it would feel like this. His endless fantasizing never managed to capture her hand’s cupping his face, lips pressing against his as he tried desperately to keep up, drinking her in as if he was dying of thirst.</span>\n</p><p>\n  <span>Sokka was forced to break the kiss first, gulping for air. His gloved hand was still curled around her neck, but it felt like holding down a mountain. Even with her in front of him again, panic rose in his chest again. His mouth opened again. “Are you— can I— </span>\n  <em>\n    <span>how—”</span>\n  </em>\n</p><p>\n  <span>She leaned in, silencing him with another, gentler kiss. “I cannot stay long. Dawn is approaching and even now, I feel a pull to my duties. There is so much I must do, so much to fix even with how little time we lost Tui… But I wanted to see you again, one last time.</span>\n</p><p>\n  <span>“I must admit, I didn’t just come out of my own selfishness. I need to ask you a favor.”</span>\n</p><p>\n  <span>“Anything,” Sokka blurted out.</span>\n</p><p>\n  <span>Yue looked at him a moment before sighing. “It really isn’t fair for me to ask, but it must be done. What happened tonight is proof that La and I are not safe. Our ties to the mortal realm expose us to great risk, yet they are necessary for us to maintain our aid of mankind. And while I am proud to fulfil my duty now, it was cruel, perhaps, to claim me such a way, leave my positioning in the world so unbalanced.”</span>\n</p><p>\n  <span>There’s another long pause when Sokka doesn’t say anything, desperately trying to think of any way he’s supposed to help, when Yue says, “I need an heir. We need heirs. Twins, who can balance the push and pull between worlds.”</span>\n</p><p>\n  <span>“Oh. </span>\n  <em>\n    <span>Oh.” </span>\n  </em>\n  <span>Sokka felt his entire body go hot, although he can barely wrap his head around Yue asking this from him. “How would that even work?”</span>\n</p><p>\n  <span>Yue smiled at him before her hands trailed down to the hem of his jacket. “Take all this off, then get into the pond.”</span>\n</p><p>\n  <span>Sokka practically tore off his clothes in his rush. It felt almost like sacrilege to dip his toe into the spirit oasis, sure that if anyone from the tribe caught him, he’d be locked away for the rest of his life, but Yue was already there, smiling up at him with the water shimmering around her shoulders, and if that wasn’t an invitation, Sokka didn’t know what was. He certainly couldn’t resist.</span>\n</p><p>\n  <span>The water was warmer than Sokka expected, almost hot in contrast to the Northern air, and while the shore dipped quickly, the rocks were neither sharp nor slippery, making it easy to find his footing. He was mere feet away from Yue once again, although this time her shoulders were bare, and in the bright light of the full moon, he swore he could make out her—</span>\n</p><p>\n  <span>There’s a splash to his left, and Sokka jumps. “Um. Is, uh, La going to be joining in, or—”</span>\n</p><p>\n  <span>Yue giggled. “No. Technically, a physical form isn’t necessary, but… I’ve always wanted a chance to do this. Hahn was always so distracted, but it wouldn’t have been appropriate for me to betray the arrangement.”</span>\n</p><p>\n  <span>“Uh huh,” Sokka said, brain trying and failing to process what that meant, that they were going to be each other’s first, and then Yue slid closer, hands on Sokka’s arms.</span>\n</p><p>\n  <span>Any shyness Sokka may have had about himself—which wasn’t a lot, okay, he was a warrior in training and looked like it—was drowned out by the way Yue leaned into Sokka touching her back, first with a brush of his fingers on her stomach then up, curling a palm over her breast. Sokka didn’t have much to compare her to, but she felt perfect to him, sounded perfect when she gasped at him thumbing at the tight pebble of her nipple.</span>\n</p><p>\n  <span>“Is that—good? For you?”</span>\n</p><p>\n  <span>“Yes,” she sighed before pulling him close once more and kissing him again, just forceful enough to seem desperate but good, too, like it’s alright for Sokka to bite at her lip then suck it better.</span>\n</p><p>\n  <span>She responded by reaching down first and squeezing at where Sokka was desperately hard, had been since that first kiss, really, but it was so good it practically hurt when Yue wrapped her delicate fingers around him and pulling, gentler that Sokka ever was with himself but better, too, because it was anyone else but also her, the most beautiful girl Sokka has ever met, the girl Sokka was so sure he’d lost forever so recently. Even if they couldn’t have past dawn—and Sokka couldn’t even let himself think that far ahead—they would always have this night together. Would have all of each other in what they were making.</span>\n</p><p>\n  <span>“Come closer,” Yue said, and she didn’t respond before pulling him towards the center of the oasis. It didn’t get deeper; instead, there was a strange rock formation, tall enough for Sokka to lie on when Yue pushed him towards it before following suit.</span>\n</p><p>\n  <span>Sokka could hardly breathe, seeing Yue bare and bright in the moonlight, lowering herself onto him. He didn’t know if spirits could flush, but she still looked so alive in that moment, her body responding to his, a desperate thrust upward making her moan, her chest rising and falling with her quickening breath, their eyes locked in a mutual desperation.</span>\n</p><p>\n  <span>It was all so desperately good that Sokka didn’t notice when the water around him started to change, but eventually a wave washing over his face made him gasp and look around. The oasis shined white as it pulled away from the shore, pooling in the middle high enough to wash over them.&nbsp;</span>\n</p><p>\n  <span>“Oh, Sokka,” Yue sighed, one arm reached out in front of her, fingers brushing just below his belly button. “I’m so glad it was you.”</span>\n</p><p>\n  <span>“Me, too,” Sokka croaked out, just thinking about this, the feeling tightening through his whole body. He never could have imagined that it would’ve felt like this; it was like he was </span>\n  <em>\n    <span>glowing,</span>\n  </em>\n  <span> expanding, from where they meet to the core of him. Blood rushed in his ears, his hands fumbling as he reached between them. “Are you— is it good? Are you good?”</span>\n</p><p>\n  <span>He groaned, high-pitched even to his own ears, as he felt where Yue was stretched tight around him, but Yue reached down, brought his fingers forward and pressed down. “Here, just keep touching me here.”</span>\n</p><p>\n  <span>So Sokka did, and Yue moaned stunningly in response, and it was good, so good. He could feel himself cresting fast, the feeling in his stomach blooming, but for the first time in his life, his tongue wouldn’t quite let him say anything. He stuttered through, “I— I can feel— close—”</span>\n</p><p>\n  <span>“Come on, Sokka,” Yue said. “Do it, come with me.”</span>\n</p><p>\n  <span>Sokka closed his eyes, but it was still blinding, his body cresting, Yue the only real thing that he could hold onto.</span>\n</p><p>\n  <span>Except the feeling didn’t completely go away as the pool calmed around him and he sat up. He palmed his stomach, and while he couldn’t feel anything amiss from the outside, he still felt… full, extended, but instead of being too enthusiastic during dinner, it was like he could still feel Yue in him.</span>\n</p><p>\n  <span>“Uh, Yue, am I supposed to… can you, like, sense something different about me?” Sokka asked, still poking at his abs. Or where his abs will soon be.&nbsp;</span>\n</p><p>\n  <span>Yue just laughed. “Yes. I’m so glad it took. I was pretty sure it would, but…” she signed happily, curling up against Sokka’s side and placing her hand over his stomach once again.</span>\n</p><p>\n  <span>Sokka blinks, hard.</span>\n</p><p>\n  <span>“Wait,” he said. “Wait. Am I— did </span>\n  <em>\n    <span>you </span>\n  </em>\n  <span>make </span>\n  <em>\n    <span>me </span>\n  </em>\n  <span>pregnant?”</span>\n</p><p>\n  <span>“Well, yes, Sokka. I don’t have a mortal body anymore,” Yue said, and, sure, it sounded obvious when she said it, but—</span>\n</p><p>\n  <span>“Okay, but I don’t exactly have the equipment to, like, grow a baby, either! Or, wait, do I?”&nbsp;</span>\n</p><p>\n  <span>“I don’t think this will happen again in your life, no,” Yue said, “but many things can be willed, in special circumstances.”</span>\n</p><p>\n  <span>“Cool. Awesome.” Sokka could feel something akin to panic growing in the back of his mind, but it doesn’t quite build like it could have on any other day where he hadn’t experienced the extremes of every human emotion possible. Absently, he curls his fingers together with Yue’s.&nbsp;</span>\n</p><p>\n  <span>“I’m sorry I didn’t make myself clear earlier,” Yue said softly. “I don’t believe it will be a very long term, if it makes you feel better. Nor will they be babies, the way you’re thinking. Just stay in the North Pole for another week, rest, recover. Come back here when the time comes.”</span>\n</p><p>\n  <span>“Will I see you again?”</span>\n</p><p>\n  <span>She rested her head on his shoulder, pressing her lips to the bone there. “It seems unlikely. Or not like this. If anything happens, the priests… well, I imagine there will need to be a bit of an adjustment, but they will help you. Anyone here will, especially after tonight.”</span>\n</p><p>\n  <span>Sokka could see the horizon just barely starting to lighten in the distance. Despite everything, Sokka felt more at peace in the silence of this moment, with his dead girlfriend’s weird spirit eggs in his gut, than he had since Katara cracked Aang out of the iceberg. He squeezed her hand, one last time.</span>\n</p><p>\n  <span>They could spare a week.</span>\n</p></div>"}
