{"uuid": "758c5b4a-c7d5-4b05-9df2-bab6742889bd", "postId": "843794757637865472", "postText": ["50 things no one tells you about becoming a parent"], "postPlatform": "Twitter", "targetParagraphs": ["You won’t find this stuff in the baby books.", "1. Your kid will cry out for you the most on nights you stay up a little later than usual.", "Binge watching goes hand in hand with binge nightmare soothing/water getting.", "2. At some point you will accidentally hurt your kid and feel like the worst parent ever.", "Try not to take it so hard. It happens to the best whether they admit it or not.", "3. Going to the bathroom in peace will become a thing of the past.", "All I ask for is one time. ONE TIME can I please go to the bathroom without a head peaking in! #momlife #momproblems", "4. It’ll be way too easy to gain a little weight.", "Kids love to eat ice cream, and what are you gonna do? Let them eat that tiny, 4-ounce kid’s cup without getting a jumbo for yourself? That would just be rude.", "5. If you co-sleep with your toddler, you shouldn’t expect to have much room.", "6. The back of your car will be a disaster.", "7. On a related note — you should always think twice before offering anyone a ride.", "Because it’s all too easy to say, \"Sure, you can ride with me!\" then remember as you walk the 40 feet to your car that the inside is a war zone.", "8. Babies’ heads are magnetically attracted to doorways.", "Or at least it seems that way, so be careful when carrying your baby into a new room.", "9. You’ll basically become a ninja.", "When you need something from the baby’s room late at night you’ll be able to slip in and out without upending a feather.", "10. Despite your best efforts, your kids will get their hands on your iPhone.", "And this is what your photos will look like afterward.", "11. You will have to sneak treats like they’re a contraband substance.", "If your kid smells the Red Vines on your breath, you’re screwed.", "12. You will laugh more than at any other time in your life.", "Kids do and say the funniest stuff ever. It’s pretty awesome.", "13. You will need to get used to seeing unflattering photos of yourself.", "Once you have a kid your top priority will be to get a good shot of your kid, not you. So, if your kid is looking at the camera and smiling that will become the keeper — even if you’re wearing your robe or squinting awkwardly.", "14. You’ll be awakened at 2 a.m. to fetch a glass of water only to find your kid passed out when you deliver it.", "The good news, though, is that the water is now totally yours!", "15. Make your kid try to pee (whether they say they need to or not) whenever you leave a place with a toilet.", "Because kids will say they don’t have to pee until \"I HAVE TO PEE RIGHT NOW I CAN’T HOLD IT OH NO I’M PEEING!\"", "16. Folding kid and baby clothes is torture.", "A normal-sized pile of laundry will take you three times as long to fold if it’s full of baby stuff.", "17. The power of cute is more formidable than you realize.", "Right now you’re like, \"I’ll never give in to my kid’s whims and desires.\" But it’s a whole lot harder when your cute kid is peering up at you with their big eyes and saying, \"Pwease?\"", "18. You will eat 95% of your meals either incredibly fast or with one hand. Or both.", "19. You will find talking to your friends without kids more difficult.", "Friend: \"I met this gorgeous girl at the club last night and we’ve been texting all day.\" You: \"I changed a poopy diaper.\" Awkward silence.", "20. Your kid will probably break something important of yours.", "Kids have a knack for breaking, dirtying, or losing stuff. It could be your glasses, smart phone, television, guitar, favorite shirt... nothing is safe!", "21. You’ll probably come across one of your kid’s dolls randomly in the middle of the night and it will shake you to the core.", "22. You will turn into your parents.", "At some point you will actually find yourself saying, \"That’s it! I will turn this car around!\" and \"Your face is gonna freeze like that!\"", "23. The knock off American Girl doll clothes at Target are WAY cheaper and your kid will love them.", "\"Why, yes, I would prefer to spend 12 bucks instead of 60.\"", "24. Your dancing will henceforth be forever referred to as \"dad dancing\" or \"mom dancing.\"", "I don’t care if you’re Beyoncé or Justin Timberlake, you will embarrass your kids if you dance.", "25. You won’t be able to watch movies where kids are killed or kidnapped.", "When you have a little person in your house who you love more than anything, those movies hit a little too close to home.", "26. Take toys your kid has lost interest in and put them in a box in the closet. Later, when your kid is bored, pull out the box and let your kid go \"toy shopping.\"", "Their old toys will suddenly be super exciting.", "27. You won’t want to spend money on yourself because you’ll know every dollar spent on yourself is a dollar you could’ve spent on your family.", "This is why parents are famous for wearing outdated jeans.", "28. Buying your kid something will make you way happier than buying yourself something.", "29. Never give your toddler your phone without putting it on guided access.", "Otherwise they’re liable to go on a binge of deleting apps and repeatedly texting \"xjsadvbli457vw\" to your boss.", "30. When your kid is little, every trip out of the house will feel like getting ready to go to the airport.", "\"Got the wipes?\" \"Check.\" \"The diapers, change of clothes, blanket, baby bottle, pacifier?\" \"Uh, check.\"", "31. Try to take it in stride when your kid says something rude like, \"Why do you have so many more gray hairs than Tommy’s mommy/daddy?\"", "Because it won’t be long before they say something like, \"You’re the best mommy/daddy in the world!\" (That one, of course, will be totally true.)", "32. You will love to watch kids’ movies.", "Not only because they’re really quality these days, but because they’re an amazing bonding experience with your kid.", "33. If you have a boy and a girl, people will ask you if you’re \"done,\" and if you have two of the same sex people will ask if you’re \"going to go for a girl/boy.\"", "34. You will cram your entire adult life between the time your kid goes down and you go to sleep.", "\"Quick! Turn on This Is Us! Pour the wine! Tell me what you think about the day’s news! Ah, crap. It’s time for bed.\"", "35. You’re going to get kicked in the crotch... a lot.", "You’ll also be elbowed in the nose, head butted, and injured in many other ways.", "36. For a while, only you will be able to understand your kid, so you will basically become their interpreter.", "Grandma: \"What did she say? Moogle woogle boo?\" You: \"No, she wants me to take her and her cousin to the park over on Smith Street next Tuesday.\"", "37. Once your kid tastes a super sugary cereal, the jig is up.", "After that getting them to eat healthy cereal will be a serious challenge.", "38. At some point your kid will say something in public that hugely embarrasses you.", "There’s no stopping it from happening, so start working on your IDGAF attitude now.", "39. Your kid will almost always rat you out to their other parent.", "So if you have to say, \"Don’t tell your mother/father\" before doing something, you probably shouldn’t do it.", "40. If you tell your kids that foods like broccoli and Brussels sprouts will make them pass gas, theyʼll suddenly be interested in eating them.", "Also, in case this one didn’t tip you off, kids can be gross.", "41. Don’t let your kid fall asleep within five minutes of getting home or they’ll be up for hours.", "\"Hey! Let’s sing the ‘We’re Almost Home’ song! WE’RE ALMOST HOME! NO SLEEPING! WE’RE ALMOST HOME!\"", "42. You will never be able to go to a McDonald’s with a Playland and leave without your kid playing in it.", "Your kid may say they’re fine with only having lunch on the way in, but they’ll change their tune once they’ve polished off their Happy Meal.", "43. Before you decide to make a cake you saw on Pinterest for your kid’s birthday party (or treats for a school event), remember — recreating Pinterest gems is harder than it looks.", "If your chocolate banana pops come out looking a little weird on a random Wednesday night no one in your family will mind. But if you bring penis-shaped banana pops to your kid’s school... well, sometimes store bought is best.", "44. Getting two kids to look at the camera at the same time is nearly impossible.", "Basically, there is no such thing as a perfect family photo.", "45. Synchronized naps are a myth.", "Do not believe the photo above... It was created by Hollywood special effects.", "46. When your kid starts school they will bring home way more artwork than you will know what to do with.", "Save the good stuff, get rid of the rest. It’s okay. Really.", "47. It will be almost impossible to get your kid to tell you how their day went.", "You: \"Just tell me one thing that happened today! JUST ONE THING!!!\"", "48. If you say something sarcastic — like that you love being your kid’s chauffeur — they will think you mean it.", "\"I don’t get why can’t you take me. You said you love driving me around!\"", "49. A fun thing to do is to make up a handshake or phrase of endearment you only use with your kid and no one else.", "Your kid will never forget it, and it will still make them smile long after you’re gone.", "50. And lastly, it’s all worth it.", "OK, so this is something people will tell you, but it’s true. Even with all of the maddening things that come along with being a parent, being someone’s mommy or daddy is one of life’s most rewarding experiences."], "targetTitle": "50 Things No One Tells You About Becoming A Parent", "targetDescription": "", "targetKeywords": "", "targetMedia": null, "targetUrl": null, "provenance": {"source": "anonymized", "humanSpoiler": null, "spoilerPublisher": null}, "spoiler": ["1. Your kid will cry out for you the most on nights you stay up a little later than usual.", "2. At some point you will accidentally hurt your kid and feel like the worst parent ever.", "3. Going to the bathroom in peace will become a thing of the past.", "4. It’ll be way too easy to gain a little weight.", "5. If you co-sleep with your toddler, you shouldn’t expect to have much room."], "spoilerPositions": [[[1, 0], [1, 90]], [[3, 0], [3, 89]], [[5, 0], [5, 66]], [[7, 0], [7, 49]], [[9, 0], [9, 77]]], "tags": ["multi"]}
{"uuid": "4e27ba71-7477-49f6-acef-3231109f1199", "postId": "4879y4", "postText": ["Is 29 February a capitalist conspiracy?"], "postPlatform": "reddit", "targetParagraphs": ["Name: 29 February.", "Age: Four times younger than every other date.", "Appearance: Hands down the worst day of the year.", "The worst day? But it’s magical. No, it isn’t. 29 February is a dirty, capitalist day, geared purely towards the needs of the 1%.", "But it’s the date when women get to propose to men. Oh, big whoop. Listen, women can do what they want when they want. But, hey, well done for reinforcing the patriarchy, 29 February. Great job.", "What if you’re born on 29 February? Doesn’t that make you special? Only special in the sense that Facebook always messes up your birthday. It has no way of telling whether you celebrate your non-leap-year birthdays on 28 February or 1 March, which means it often gets it wrong.", "Can we go back a bit? Why is 29 February capitalist? Let me ask you a question. Are you on a salary?", "Yes. And that salary is based on the assumption that you work full-time over a 365-day year?", "That’s right. Well, there are 366 days this year. Today, you’re basically working for free.", "What? That’s an outrage! I know! We should all down tools, right this minute. If our greedy corporate overlords valued us in the slightest, they’d give us an extra day’s pay. Right now. In an envelope.", "Actually, they should give me two envelopes, because I’m writing both sides of this conversation. It gets worse. Banks don’t usually count 29 February when they work out customer interest. Today, the banks keep back your hard-earned money as profit.", "That’s disgusting. Something should be done. It’s terrible. Roll on the year 2100, I say.", "Why? Isn’t that a leap year, too? No, because years divisible by 100 aren’t leap years. February 2100 will only have 28 days.", "But 2000 was a year divisible by 100, and that was a leap year. Yes, but only because 2000 is also divisible by 400, which negates the previous \"divisible by 100\" rule.", "I’m so confused. See? This is exactly what the corporations want. To rule by obfuscation. They’re bleeding us dry. We’re all doomed.", "Do say: \"Occupy 29 February!\"", "Don’t say: \"Actually, I’m freelance, so none of this means anything to me.\""], "targetTitle": "Is 29 February a capitalist conspiracy?", "targetDescription": "The leap day is a women-hating, salary-stealing, birthday-wrecking, interest-hungry excuse for 24 hours", "targetKeywords": "Mathematics,Astronomy,Science", "targetMedia": ["https://i.guim.co.uk/img/media/25f10cb81543be6a86831dd79eb155da3b9201b7/0_271_4444_2667/master/4444.jpg?w=300&q=55&auto=format&usm=12&fit=max&s=c587f1c1c7182934a1e8f402b6f02c06", "https://i.guim.co.uk/img/media/25f10cb81543be6a86831dd79eb155da3b9201b7/0_271_4444_2667/master/4444.jpg?w=1200&h=630&q=55&auto=format&usm=12&fit=crop&crop=faces%2Centropy&bm=normal&ba=bottom%2Cleft&blend64=aHR0cHM6Ly91cGxvYWRzLmd1aW0uY28udWsvMjAxNi8wNS8yNS9vdmVybGF5LWxvZ28tMTIwMC05MF9vcHQucG5n&s=46a25a864f2b177391a219e27adf88c3", "https://sb.scorecardresearch.com/p?c1=2&c2=6035250&cv=2.0&cj=1", "https://www.facebook.com/tr?id=108317535975354&ev=PageView&noscript=1", "https://beacon.gu-web.net/count/pv.gif", "https://beacon.gu-web.net/count/pvg.gif", "https://googleads.g.doubleclick.net/pagead/viewthroughconversion/971225648/?value=0&guid=ON&script=0"], "targetUrl": "https://www.theguardian.com/science/shortcuts/2016/feb/28/is-29-february-capitalist-conspiracy?CMP=twt_gu", "provenance": {"source": "anonymized", "humanSpoiler": "According to the \"article\" yes. But really no.", "spoilerPublisher": "savedyouaclick"}, "spoiler": ["Let me ask you a question. Are you on a salary? Yes. And that salary is based on the assumption that you work full-time over a 365-day year? That’s right. Well, there are 366 days this year. Today, you’re basically working for free."], "spoilerPositions": [[[6, 53], [8, 91]]], "tags": ["passage"]}
