{"uuid": "758c5b4a-c7d5-4b05-9df2-bab6742889bd", "postId": "843794757637865472", "postText": ["50 things no one tells you about becoming a parent"], "postPlatform": "Twitter", "targetParagraphs": ["You won’t find this stuff in the baby books.", "1. Your kid will cry out for you the most on nights you stay up a little later than usual.", "Binge watching goes hand in hand with binge nightmare soothing/water getting.", "2. At some point you will accidentally hurt your kid and feel like the worst parent ever.", "Try not to take it so hard. It happens to the best whether they admit it or not.", "3. Going to the bathroom in peace will become a thing of the past.", "All I ask for is one time. ONE TIME can I please go to the bathroom without a head peaking in! #momlife #momproblems", "4. It’ll be way too easy to gain a little weight.", "Kids love to eat ice cream, and what are you gonna do? Let them eat that tiny, 4-ounce kid’s cup without getting a jumbo for yourself? That would just be rude.", "5. If you co-sleep with your toddler, you shouldn’t expect to have much room.", "6. The back of your car will be a disaster.", "7. On a related note — you should always think twice before offering anyone a ride.", "Because it’s all too easy to say, \"Sure, you can ride with me!\" then remember as you walk the 40 feet to your car that the inside is a war zone.", "8. Babies’ heads are magnetically attracted to doorways.", "Or at least it seems that way, so be careful when carrying your baby into a new room.", "9. You’ll basically become a ninja.", "When you need something from the baby’s room late at night you’ll be able to slip in and out without upending a feather.", "10. Despite your best efforts, your kids will get their hands on your iPhone.", "And this is what your photos will look like afterward.", "11. You will have to sneak treats like they’re a contraband substance.", "If your kid smells the Red Vines on your breath, you’re screwed.", "12. You will laugh more than at any other time in your life.", "Kids do and say the funniest stuff ever. It’s pretty awesome.", "13. You will need to get used to seeing unflattering photos of yourself.", "Once you have a kid your top priority will be to get a good shot of your kid, not you. So, if your kid is looking at the camera and smiling that will become the keeper — even if you’re wearing your robe or squinting awkwardly.", "14. You’ll be awakened at 2 a.m. to fetch a glass of water only to find your kid passed out when you deliver it.", "The good news, though, is that the water is now totally yours!", "15. Make your kid try to pee (whether they say they need to or not) whenever you leave a place with a toilet.", "Because kids will say they don’t have to pee until \"I HAVE TO PEE RIGHT NOW I CAN’T HOLD IT OH NO I’M PEEING!\"", "16. Folding kid and baby clothes is torture.", "A normal-sized pile of laundry will take you three times as long to fold if it’s full of baby stuff.", "17. The power of cute is more formidable than you realize.", "Right now you’re like, \"I’ll never give in to my kid’s whims and desires.\" But it’s a whole lot harder when your cute kid is peering up at you with their big eyes and saying, \"Pwease?\"", "18. You will eat 95% of your meals either incredibly fast or with one hand. Or both.", "19. You will find talking to your friends without kids more difficult.", "Friend: \"I met this gorgeous girl at the club last night and we’ve been texting all day.\" You: \"I changed a poopy diaper.\" Awkward silence.", "20. Your kid will probably break something important of yours.", "Kids have a knack for breaking, dirtying, or losing stuff. It could be your glasses, smart phone, television, guitar, favorite shirt... nothing is safe!", "21. You’ll probably come across one of your kid’s dolls randomly in the middle of the night and it will shake you to the core.", "22. You will turn into your parents.", "At some point you will actually find yourself saying, \"That’s it! I will turn this car around!\" and \"Your face is gonna freeze like that!\"", "23. The knock off American Girl doll clothes at Target are WAY cheaper and your kid will love them.", "\"Why, yes, I would prefer to spend 12 bucks instead of 60.\"", "24. Your dancing will henceforth be forever referred to as \"dad dancing\" or \"mom dancing.\"", "I don’t care if you’re Beyoncé or Justin Timberlake, you will embarrass your kids if you dance.", "25. You won’t be able to watch movies where kids are killed or kidnapped.", "When you have a little person in your house who you love more than anything, those movies hit a little too close to home.", "26. Take toys your kid has lost interest in and put them in a box in the closet. Later, when your kid is bored, pull out the box and let your kid go \"toy shopping.\"", "Their old toys will suddenly be super exciting.", "27. You won’t want to spend money on yourself because you’ll know every dollar spent on yourself is a dollar you could’ve spent on your family.", "This is why parents are famous for wearing outdated jeans.", "28. Buying your kid something will make you way happier than buying yourself something.", "29. Never give your toddler your phone without putting it on guided access.", "Otherwise they’re liable to go on a binge of deleting apps and repeatedly texting \"xjsadvbli457vw\" to your boss.", "30. When your kid is little, every trip out of the house will feel like getting ready to go to the airport.", "\"Got the wipes?\" \"Check.\" \"The diapers, change of clothes, blanket, baby bottle, pacifier?\" \"Uh, check.\"", "31. Try to take it in stride when your kid says something rude like, \"Why do you have so many more gray hairs than Tommy’s mommy/daddy?\"", "Because it won’t be long before they say something like, \"You’re the best mommy/daddy in the world!\" (That one, of course, will be totally true.)", "32. You will love to watch kids’ movies.", "Not only because they’re really quality these days, but because they’re an amazing bonding experience with your kid.", "33. If you have a boy and a girl, people will ask you if you’re \"done,\" and if you have two of the same sex people will ask if you’re \"going to go for a girl/boy.\"", "34. You will cram your entire adult life between the time your kid goes down and you go to sleep.", "\"Quick! Turn on This Is Us! Pour the wine! Tell me what you think about the day’s news! Ah, crap. It’s time for bed.\"", "35. You’re going to get kicked in the crotch... a lot.", "You’ll also be elbowed in the nose, head butted, and injured in many other ways.", "36. For a while, only you will be able to understand your kid, so you will basically become their interpreter.", "Grandma: \"What did she say? Moogle woogle boo?\" You: \"No, she wants me to take her and her cousin to the park over on Smith Street next Tuesday.\"", "37. Once your kid tastes a super sugary cereal, the jig is up.", "After that getting them to eat healthy cereal will be a serious challenge.", "38. At some point your kid will say something in public that hugely embarrasses you.", "There’s no stopping it from happening, so start working on your IDGAF attitude now.", "39. Your kid will almost always rat you out to their other parent.", "So if you have to say, \"Don’t tell your mother/father\" before doing something, you probably shouldn’t do it.", "40. If you tell your kids that foods like broccoli and Brussels sprouts will make them pass gas, theyʼll suddenly be interested in eating them.", "Also, in case this one didn’t tip you off, kids can be gross.", "41. Don’t let your kid fall asleep within five minutes of getting home or they’ll be up for hours.", "\"Hey! Let’s sing the ‘We’re Almost Home’ song! WE’RE ALMOST HOME! NO SLEEPING! WE’RE ALMOST HOME!\"", "42. You will never be able to go to a McDonald’s with a Playland and leave without your kid playing in it.", "Your kid may say they’re fine with only having lunch on the way in, but they’ll change their tune once they’ve polished off their Happy Meal.", "43. Before you decide to make a cake you saw on Pinterest for your kid’s birthday party (or treats for a school event), remember — recreating Pinterest gems is harder than it looks.", "If your chocolate banana pops come out looking a little weird on a random Wednesday night no one in your family will mind. But if you bring penis-shaped banana pops to your kid’s school... well, sometimes store bought is best.", "44. Getting two kids to look at the camera at the same time is nearly impossible.", "Basically, there is no such thing as a perfect family photo.", "45. Synchronized naps are a myth.", "Do not believe the photo above... It was created by Hollywood special effects.", "46. When your kid starts school they will bring home way more artwork than you will know what to do with.", "Save the good stuff, get rid of the rest. It’s okay. Really.", "47. It will be almost impossible to get your kid to tell you how their day went.", "You: \"Just tell me one thing that happened today! JUST ONE THING!!!\"", "48. If you say something sarcastic — like that you love being your kid’s chauffeur — they will think you mean it.", "\"I don’t get why can’t you take me. You said you love driving me around!\"", "49. A fun thing to do is to make up a handshake or phrase of endearment you only use with your kid and no one else.", "Your kid will never forget it, and it will still make them smile long after you’re gone.", "50. And lastly, it’s all worth it.", "OK, so this is something people will tell you, but it’s true. Even with all of the maddening things that come along with being a parent, being someone’s mommy or daddy is one of life’s most rewarding experiences."], "targetTitle": "50 Things No One Tells You About Becoming A Parent", "targetDescription": "", "targetKeywords": "", "targetMedia": null, "targetUrl": null, "provenance": {"source": "anonymized", "humanSpoiler": null, "spoilerPublisher": null}, "spoiler": ["1. Your kid will cry out for you the most on nights you stay up a little later than usual.", "2. At some point you will accidentally hurt your kid and feel like the worst parent ever.", "3. Going to the bathroom in peace will become a thing of the past.", "4. It’ll be way too easy to gain a little weight.", "5. If you co-sleep with your toddler, you shouldn’t expect to have much room."], "spoilerPositions": [[[1, 0], [1, 90]], [[3, 0], [3, 89]], [[5, 0], [5, 66]], [[7, 0], [7, 49]], [[9, 0], [9, 77]]], "tags": ["multi"]}
{"uuid": "4e27ba71-7477-49f6-acef-3231109f1199", "postId": "4879y4", "postText": ["Is 29 February a capitalist conspiracy?"], "postPlatform": "reddit", "targetParagraphs": ["Name: 29 February.", "Age: Four times younger than every other date.", "Appearance: Hands down the worst day of the year.", "The worst day? But it’s magical. No, it isn’t. 29 February is a dirty, capitalist day, geared purely towards the needs of the 1%.", "But it’s the date when women get to propose to men. Oh, big whoop. Listen, women can do what they want when they want. But, hey, well done for reinforcing the patriarchy, 29 February. Great job.", "What if you’re born on 29 February? Doesn’t that make you special? Only special in the sense that Facebook always messes up your birthday. It has no way of telling whether you celebrate your non-leap-year birthdays on 28 February or 1 March, which means it often gets it wrong.", "Can we go back a bit? Why is 29 February capitalist? Let me ask you a question. Are you on a salary?", "Yes. And that salary is based on the assumption that you work full-time over a 365-day year?", "That’s right. Well, there are 366 days this year. Today, you’re basically working for free.", "What? That’s an outrage! I know! We should all down tools, right this minute. If our greedy corporate overlords valued us in the slightest, they’d give us an extra day’s pay. Right now. In an envelope.", "Actually, they should give me two envelopes, because I’m writing both sides of this conversation. It gets worse. Banks don’t usually count 29 February when they work out customer interest. Today, the banks keep back your hard-earned money as profit.", "That’s disgusting. Something should be done. It’s terrible. Roll on the year 2100, I say.", "Why? Isn’t that a leap year, too? No, because years divisible by 100 aren’t leap years. February 2100 will only have 28 days.", "But 2000 was a year divisible by 100, and that was a leap year. Yes, but only because 2000 is also divisible by 400, which negates the previous \"divisible by 100\" rule.", "I’m so confused. See? This is exactly what the corporations want. To rule by obfuscation. They’re bleeding us dry. We’re all doomed.", "Do say: \"Occupy 29 February!\"", "Don’t say: \"Actually, I’m freelance, so none of this means anything to me.\""], "targetTitle": "Is 29 February a capitalist conspiracy?", "targetDescription": "The leap day is a women-hating, salary-stealing, birthday-wrecking, interest-hungry excuse for 24 hours", "targetKeywords": "Mathematics,Astronomy,Science", "targetMedia": ["https://i.guim.co.uk/img/media/25f10cb81543be6a86831dd79eb155da3b9201b7/0_271_4444_2667/master/4444.jpg?w=300&q=55&auto=format&usm=12&fit=max&s=c587f1c1c7182934a1e8f402b6f02c06", "https://i.guim.co.uk/img/media/25f10cb81543be6a86831dd79eb155da3b9201b7/0_271_4444_2667/master/4444.jpg?w=1200&h=630&q=55&auto=format&usm=12&fit=crop&crop=faces%2Centropy&bm=normal&ba=bottom%2Cleft&blend64=aHR0cHM6Ly91cGxvYWRzLmd1aW0uY28udWsvMjAxNi8wNS8yNS9vdmVybGF5LWxvZ28tMTIwMC05MF9vcHQucG5n&s=46a25a864f2b177391a219e27adf88c3", "https://sb.scorecardresearch.com/p?c1=2&c2=6035250&cv=2.0&cj=1", "https://www.facebook.com/tr?id=108317535975354&ev=PageView&noscript=1", "https://beacon.gu-web.net/count/pv.gif", "https://beacon.gu-web.net/count/pvg.gif", "https://googleads.g.doubleclick.net/pagead/viewthroughconversion/971225648/?value=0&guid=ON&script=0"], "targetUrl": "https://www.theguardian.com/science/shortcuts/2016/feb/28/is-29-february-capitalist-conspiracy?CMP=twt_gu", "provenance": {"source": "anonymized", "humanSpoiler": "According to the \"article\" yes. But really no.", "spoilerPublisher": "savedyouaclick"}, "spoiler": ["Let me ask you a question. Are you on a salary? Yes. And that salary is based on the assumption that you work full-time over a 365-day year? That’s right. Well, there are 366 days this year. Today, you’re basically working for free."], "spoilerPositions": [[[6, 773], [9, 1005]]], "tags": ["passage"]}
{"uuid": "500e836c-33ff-4406-9712-c7c9726a18d7", "postId": "844521804794343424", "postText": ["How to make the most of your workday"], "postPlatform": "Twitter", "targetParagraphs": ["How to Make the Most of Your Workday", "Do you often find your workday spiraling out of control? You start each day with a plan to get so much done, but soon find yourself becoming distracted, focusing on low-priority tasks and, simply, procrastinating. So how can you regain control of your time? One-size-fits-all lists on how to be more productive don't work; we’ll outline productivity techniques that can be adapted to your personality and working style.", "All workers and workdays are unique. With fewer companies and employees adhering to a traditional 9-to-5 day, the differences in our workdays are becoming more pronounced. But putting those differences aside, three overarching ideas apply to all our productivity tips:", "1. Trust the small increments. You can’t expect to change years of working habits overnight. Small changes in how you work can gradually add up to big changes in productivity. Try one tip to start, and keep adding more as you find the strategies that work best for you.", "2. Be accountable. Whether it’s weekly check-ins with a co-worker or setting your own deadlines and announcing them to others, having to answer to someone else can often force you to get the job done.", "3. Forgive yourself. You are human: Accept that you are sometimes going to slip up, become distracted and have a bad day. It’s more important to move on than to dwell on your mistakes.", "Think you can get more done by juggling multiple tasks at the same time? Try calling your co-worker while typing an e-mail and checking your Facebook page. You may feel as if you’re being productive, but you’re probably not getting any of those tasks done efficiently.", "We all have a limited amount of cognitive bandwidth — the number of thoughts and memories we can hold in our minds at any given time. Your brain may delude itself into thinking that it has more capacity than it really does, but it’s really working extra hard to handle multiple thoughts at once when you are switching back and forth between tasks. Your ability to get things done depends on how well you can focus on one task at a time, whether it’s for five minutes or an hour.", "\"Multitasking is not humanly possible,\" said Earl K. Miller, a neuroscience professor at the Picower Institute for Learning and Memory at the Massachusetts Institute of Technology.", "When you multitask, you tend to make more mistakes. When you toggle back and forth between tasks, the neural networks of your brain must backtrack to figure out where they left off and then reconfigure, Dr. Miller said. That extra activity causes you to slow down, and errors become more likely.", "\"People are much more efficient if they monotask,\" he said.", "Trying to multitask also impedes creativity, he said. Truly innovative thinking arises when we allow our brains to follow a logical path of associated thoughts and ideas, and this is more likely when we can focus on a single mental pathway for an extended period.", "To the best of your ability, set up a work environment that encourages the performing of one task at a time. It’s probably not realistic to think that we can block off hours at a time for a single task, but even committing to monotask for five minutes can yield productivity benefits.", "Here are a few small changes you can make:", "Remove temptation: Actively resist the urge to check unrelated social media while you are working on a task. Some workers may need to go so far as to install anti-distraction programs like SelfControl, Freedom, StayFocusd and Anti-Social, which block access to the most addictive parts of the internet for specified periods.", "Work on just one screen: Put away your cellphone and turn off your second monitor.", "Move: If you find yourself losing focus – reading the same sentence over and over or if your mind continually wanders off topic – get up and briefly walk around, Dr. Miller said. A brief walk around your office can lift your mood, reduce hunger and help you refocus.", "The tendency to become distracted is primal, so forgive yourself if you do. It arose in our earliest days as humans, when we needed to respond instantly to lions, tigers and other predators that threatened us, said Dr. Miller. Every sensory input was deeply interesting, and our response to it was sometimes a matter of life or death. Our brain has not let go of this ancient survival mechanism; we still crave that informational tap on the shoulder, he said.", "Policy makers often fret that worker productivity isn’t growing fast enough. And each of us also worries about individual productivity.", "Monotasking is a 21st-century term for what your high school English teacher probably called \"paying attention.\"", "We will never stop dawdling. So why should we feel guilty about it?", "Employers of all types are using a wide range of technological tools to monitor workers’ efforts and motivate them.", "To combat procrastination, find an accountability partner. This can be a colleague or a manager, whose role is to receive regular progress reports on your project. The person you choose will have to take his or her role seriously, expressing disappointment if you have not achieved your goal, and appreciation if you have. Some inveterate procrastinators even agree on a set of rewards or punishments to go along with their deadlines, depending on what motivates them the most. A reward could be a free lunch; a punishment could be an email to the department announcing that a deadline was not met.", "To-do lists work to keep you accountable because they help you stay on the path to getting your most important work done – if you use them effectively, that is.", "Before you leave work for the day, make a list of five to eight goals that you would like to accomplish the following day, said Julie Morgenstern, a time management expert based in New York. On a separate list add any personal errands that need to be done that day — like booking a flight for a vacation or buying a birthday gift. That list should contain no more than two or three items. Be realistic about what you can accomplish in a day of work, and resist the urge to make a to-do list for the whole week, which can leave you feeling stressed and overwhelmed.", "Make the items on your to-do list specific, realistic and simple — don’t secretly pack eight or 10 tasks inside one huge item, like \"finish project.\" Instead, break your project into small, discrete components.", "GOOD TO-DO LIST", "BAD TO-DO LIST", "Because our primal mind craves distraction, the classic to-do list can prevent interruptions from taking over your day. But humans are also vulnerable to so-called \"structured procrastination,\" where in order to avoid working on a hard task, they spend time on a much easier one. Answering an email or liking a post on Facebook can be a form of structured procrastination. Writing your to-do list can also be a form of structured procrastination. So, give yourself five minutes or less to write a to-do list each morning. Keep it focused and short, so you’re not spending more time checking off items than actually completing them.", "Some people like to keep their lists on paper – making emphatic and satisfying checkmarks whenever they complete a task. Others prefer the computer route. If that’s the case, many apps are available, including these:", "To avoid confusion, pick either paper or digital for your lists, as it can be hard to manage both.", "There’s no one right way to organize a desk. But your physical workspace can have a big effect on productivity. It \"can either energize you or deplete your energy,\" said Ms. Morgenstern, the time management expert.", "In general, only 25 percent of a desk’s messiness is related to organizational skills, Ms. Morgenstern maintains – the rest is tied to time management. \"Every paper on your desk has a task associated with it, and that task is going to take time.\" Have you factored in enough time to get it all done? Out-of-control piles of paper may be a sign that you need to delegate, she said.", "Ask yourself: Are the piles on your desk the same ones that were there three weeks ago, or are they moving? As long as they’re not stagnant, you’re probably doing O.K. with some clutter, Ms. Morgenstern said.", "In most cases, keep your desk clear except for the project you are tackling at the moment, along with the equipment you need to complete it, she said. You should also create a space for an \"in zone\" – brand new things that have just come in – and an \"out zone\" for things that are finished and need to be distributed.", "Not understanding the capabilities of your computer can be a serious hindrance to your productivity. Some people fear that asking for tech help will make them look incompetent, but in fact the opposite is true, according to research.", "Ask for technology advice when you think a computer or online task is taking longer than it should. It could be that you don’t know how to use a particular type of technology efficiently, or you don’t know what a company’s past practices have been in a certain area. Make an effort to seek out the people who can fill in your knowledge gaps, while being respectful of their time and responsibilities.", "Managers can assist in this process by offering regular information sessions and company-specific manuals related to technology like email, Excel, Microsoft Word, Slack and others. A mentorship program is another option.", "Do you find yourself constantly stopping to check your email? Email is an ideal way to practice structured procrastination — when you work on an easy, unimportant task rather than tackle a harder, important one.", "Email is like life: It is messy, imperfect, full of surprises, and everybody handles it differently. There is no perfect email system. Experts may promote the value of techniques like \"Inbox Zero,\" where you try to clear your inbox every day, but even if your inbox is empty, your work life – with all its unanswered questions, incomplete projects and challenging problems – will remain full. Embrace the daily challenge of keeping your work life under control by using email as your ally rather than your nemesis.", "Here are a few techniques that can help make your email work for you:", "Learn the strategies that chief executives have developed through trial and error to help you go beyond the polished résumés, pre-screened references and scripted answers, to hire more creative and effective members for your team.", "Spend a week or two identifying the email issues that consistently frustrate you or slow you down. Then, find an \"email guru\" in your company and see if that person would be willing to sit down with you for a half-hour to explain the various capabilities of your email system. Your guru could be a super-efficient co-worker or someone from tech support, but it should be someone who can show you how to use built-in features that you may not be aware of, like filters that can block unimportant messages and send them to spam. Ask about how you can use labels, folders, filters, archives, starred messages, unsubscribe lists and other features to help you spend less time on email.", "It can be a good idea to clean up your desk. But not if you’re looking to be creative.", "A new survey finds that e-mail is very important to three-fifths of American workers.", "Does an overflowing space where books, papers, and yes, pencils, pile up everywhere feel more inspiring to you?", "Take a close look at how successful people organize their work spaces.", "Working continuously and for long hours does not mean you’re getting more done. Sometimes the best way to get something done is not to work on it for a while.", "Sitting for long periods of time is just plain bad for you, but it’s also bad for your ability to be productive. Standing up and moving around improves blood flow to the brain, which enhances cognition. Alan Hedge, an ergonomics professor at Cornell, suggests that workers try a combination of sitting, standing and walking to keep altering their body position and give their minds a break from work.", "How to Make Desk Work More Productive", "A timed combination of sitting, standing and walking can help you work at your best.", "Where were you the last time you had a great idea? Your desk? Or was it when you were in the shower, while you were walking your dog or driving your kids to school?", "Working a 10- to 12-hour day may earn you points with some bosses, but it’s not great for creativity. Instead of powering through, consider intentionally taking a break from a large project for up to 10 hours. That will allow new ideas to marinate in your subconscious, causing your neurons to make new connections.", "Sleep is one of the most effective ways to take a long break, so try not to give it short shrift. Research shows that sleep allows our brains to make new and unexpected connections, leading to insights and breakthroughs — which explains why we so often have brilliant ideas during our morning shower.", "It’s pretty common to feel a \"post-lunch dip\" in the midafternoon. Your body naturally wants to go to sleep about seven hours after waking, and this is amplified by the effects of digestion. Unfortunately, this biological reality collides with an economic one: Most offices frown on napping.", "If it’s possible to take a 20-minute \"power nap\" at work (for example if you work at home), by all means do so. To best increase your energy, it may be a good idea to drink a cup of coffee before your nap. Research has shown that this method likely works because the short power nap helps clear the brain of the sleep-inducing compound adenosine. Caffeine, meanwhile, takes about 20 minutes to have its physiological effect — kicking in just as the napper is awakening.", "When we feel overwhelmed at work, our fight-or-flight response tends to come into play, leading us to take quick, shallow breaths. This sends less oxygen to the brain, causing us to become even more stressed and to think less clearly. Counteract the effects of stress by breathing more efficiently.", "Most people are vertical breathers, in that their shoulders move up when they inhale, according to Belisa Vranich, a clinical psychologist and breath instructor. Many people also breathe from their upper chest, whereas the biggest part of the lungs is in the middle of the body.", "Horizontal breathing may seem unnatural at first, but it is actually the way animals and small children breathe. Working with your body rather than against it, you will maximize the blood flow to your brain – and your mental capacity.", "This technique can help you fight stress by taking deeper breaths.", "This technique can help you fight stress by taking deeper breaths.", "When you feel stressed, you may start to lift your shoulders up toward your ears, clench your face or tense up all over. Over time, these actions become so habitual that you become unaware of them. The purpose of good posture is to expand our bodies rather than to compress them. Good posture allows you to breathe more fully, prevent chronic pain and think more clearly.", "As you do your work, try to be aware of any excess tension you are holding in your body. For example, you may tense up your hands far more than necessary when you type or use a mouse. If you start to feel any tension, try to stretch that area of your body.", "Try this exercise to improve your work posture.", "This exercise is a component of the Alexander Technique, a way of learning about how to rid your body of harmful tension. According to Lindsay Newitter, owner of the Posture Police in New York, this technique warns of a practice called \"end gaining,\" where people try to get ahead of themselves and lose sight of the present. When you see people hunched forward in front of their screens, chances are they are end gaining. Good posture enables you to meet your work in the present moment, and therefore get it done more efficiently.", "An author explains how seeing problems from a different perspective may have a similar outcome as the Eastern approach of suspending thought.", "Delaying the completion of a project may actually make you more creative.", "Treadmill desks can be good exercise, but they may impair the ability to concentrate and remember.", "Too often \"engagement\" refers to employees who get to work early, stay late and remain connected. That’s not a recipe for enduring high performance.", "Myth: People who are good multitaskers get more done.", "Fact: Multitasking is an illusion. Research shows that people get more done if they concentrate on one task at a time. Switching frequently between tasks – or believing that you are actually doing more than one thing at once – will actually slow you down.", "Myth: It’s important to have zero emails in your inbox by the end of the day.", "Fact: The goal of \"inbox zero\" works for some people but not for others. The key to managing email is to designate specific times of the day for reading and responding to it, to differentiate between emails that can be handled quickly and those that require more time, and to learn how to use all of your email software’s features (folders, filters and archives) in ways that work best for you.", "Myth: It’s best to stand while you work.", "Fact: It’s better to change your position throughout the day, in a regular cycle of sitting, standing and moving around. Among other things, this variety helps bring more blood to your brain, improving your cognition and therefore your productivity.", "Myth: The more hours you work, the more you get done.", "Fact: It is important to take breaks throughout the workday. Even a five-minute walk around the office can boost your mood with no impact on your ability to focus. Getting enough rest and sleep can serve you better than working longer hours. Walking away from your work for a longer period – overnight, over the weekend or on vacation – gives your ideas a chance to marinate in your subconscious mind, allowing for new bursts of productivity when you return.", "Myth: The secret to improving productivity is to find the right system and stick with it.", "Fact: Every person and every workday is different. While we may be able to develop new strategies and habits that work for us most of the time, our jobs and lives will always throw us curve balls that lead to less-than-perfect results. We need to accept this imperfect reality, forgive ourselves and try again tomorrow."], "targetTitle": "How to Improve Your Productivity at Work - Business Guides", "targetDescription": "Take control of your time at work. We’ll outline productivity techniques that can be adapted to your personality and working style.", "targetKeywords": "", "targetMedia": null, "targetUrl": null, "provenance": {"source": "anonymized", "humanSpoiler": null, "spoilerPublisher": null}, "spoiler": ["1. Trust the small increments.", "2. Be accountable.", "3. Accept that you are sometimes going to slip up", "set up a work environment that encourages the performing of one task at a time", "A brief walk around your office can lift your mood, reduce hunger and help you refocus"], "spoilerPositions": [[[3, 0], [3, 30]], [[4, 0], [4, 18]], [[3, 727], [3, 757]], [[12, 29], [12, 107]], [[16, 179], [16, 265]]], "tags": ["multi"]}
